{
    "text": " I think your dreams deserve five minutes in the morning before you let the world in. No one can live without a routine. You just forget that. If you guys don't have a routine, I would recommend, like, you get one going, because you cannot be mentally healthy without a routine. You need to pick a time to get up. Whatever time you want, but pick one and stick to it because otherwise... You dysregulate your circadian rhythms and they regulate your mood. When you wake up each day, the first thing to do is not go to the computer. The first thing to do is go exercise, go for a walk, take a long shower. It's to open your body and engage. And in doing that process, whatever it is for you, some people it's a long run, some people it's a longer shower, some people it's a walk around the neighborhood. When you're doing that, here's what I want you to ask yourself. A couple of simple questions. First, I want you to ask yourself, what am I excited about today? When I wake up in the morning, I spend the first 10 minutes just thanking you. I don't even address any problems and stuff I got. I'm just grateful that I'm up for this. And I think every little thing. And I spend 10 minutes. And it makes your day start such a wonderful way to realize that you woke up. You're here. You do gratitude meditation. You know, wake up in the morning, shower, go to a quiet place in your home or apartment, sit down for five minutes close your eyes you do a couple of breathing exercises maybe just take a few deep breaths to relax yourself and then start having that conversation with yourself I want you to begin your day with enthusiasm optimism is the magical formula that creates greater happiness in our lives to have something to look forward to steal away someone's vision for a good future and you quickly see them fall into depression. But when we have a great connection to something in the future that we look forward to, even if it's just this day, that creates the charge within us. So walk around, take your laps, do whatever you have to do in the morning, but ask yourself, what is it that I'm excited about today or could be enthusiastic about today? This is a really good day. My vortex is full of manifested potential. of manifested potential. My vortex is a now reality that I can feel my way into. Today I intend to feel exhilaration about things not yet manifested because I understand the reality of them. You must come up with a morning routine that you do every single morning or at least more mornings than not that puts you in control of yourself and in control of your day. This is what I do, and I cannot explain the power that I get from starting my day off and being bigger than my excuses and being in control. First and foremost, wake up on time. When that alarm goes off, get your butt out of bed. 5, 4, 3, 2, 1, go. Why is that important for persistence? The reason why is because the first decision that you're making of the day is to actually get up and get moving. That means you are persistently moving. bigger than your excuses. You are persistently bigger than feeling lazy. Don't carry negative baggage from yesterday into today. You won't live a victorious life if you're always reliving what didn't work out, who hurt you, the mistakes you've made. The reason it's called the past is because it's over. It's done. It's history. Now do your part and let it go. you",
    "segments": [
        [
            0.0,
            9.12
        ],
        [
            11.92,
            15.32
        ],
        [
            15.4,
            19.88
        ],
        [
            20.08,
            23.3
        ],
        [
            23.74,
            25.5
        ],
        [
            25.98,
            29.0
        ],
        [
            29.0,
            30.02
        ],
        [
            30.036575,
            34.436575
        ],
        [
            35.276575,
            40.256575
        ],
        [
            40.516575,
            46.816575
        ],
        [
            47.216575,
            49.136575
        ],
        [
            49.556574999999995,
            56.856575
        ],
        [
            56.856575,
            60.316575
        ],
        [
            60.31605,
            64.35605
        ],
        [
            65.35605,
            69.97605
        ],
        [
            70.59604999999999,
            73.41605
        ],
        [
            73.53605,
            75.69605
        ],
        [
            75.79605,
            77.25605
        ],
        [
            77.63605,
            78.43605
        ],
        [
            78.65605,
            82.81604999999999
        ],
        [
            83.15605,
            83.69605
        ],
        [
            83.89605,
            85.55605
        ],
        [
            85.55605,
            91.69605
        ],
        [
            91.68508,
            96.58508
        ],
        [
            96.58508,
            100.36508
        ],
        [
            100.36508,
            106.30508
        ],
        [
            106.30508,
            111.36508
        ],
        [
            111.36508,
            115.92508
        ],
        [
            115.92508,
            117.02508
        ],
        [
            117.02508,
            122.68508
        ],
        [
            122.672345,
            127.57234500000001
        ],
        [
            127.57234500000001,
            132.992345
        ],
        [
            133.212345,
            137.172345
        ],
        [
            137.952345,
            146.13234500000002
        ],
        [
            146.13234500000002,
            147.652345
        ],
        [
            150.392345,
            153.41234500000002
        ],
        [
            153.839935,
            164.299935
        ],
        [
            165.059935,
            180.19993499999998
        ],
        [
            180.799935,
            189.119935
        ],
        [
            189.119935,
            192.599935
        ],
        [
            193.159935,
            195.799935
        ],
        [
            195.799935,
            214.999935
        ],
        [
            215.00827999999998,
            221.24828
        ],
        [
            222.14827999999997,
            229.60827999999998
        ],
        [
            229.60827999999998,
            235.64828
        ],
        [
            236.20827999999997,
            241.92827999999997
        ],
        [
            242.24828,
            244.22827999999998
        ],
        [
            254.5137,
            255.0137
        ]
    ],
    "language": "en"
}