{
  "title": "Channel 5 origin story | Andrew Callaghan and Lex Fridman",
  "transcription": " There's two people in the back, two of her homegirls wearing like sheisty masks.  I'm like, what are we doing?  Where are we going?  And she goes, we're going to go film the riot.  We're going to Lake Street.  And so we drive down there.  Kmart is burning.  Target is burning.  Everything is on fire.  She has the Sony A7.  She gives me a microphone and she's like, go talk to that guy.  And that was the guy with a Molotov cocktail in his hand who had just burned Kmart down. And so I go, what should I ask him? She goes, what's on your mind? So I walk up to him. I'm like, what's on your mind?  The following is a conversation with Andrew Callaghan, host of Channel 5 on YouTube,  where he does Godzilla style interviews with fascinating humans at the  edges of society, the so-called vagrants, vagabonds, runaways, outlaws, from QAnon adherents  to fish heads to O-Block residents, and much more.  He created the documentary that I highly recommend called This Place Rules on the undercurrents  that led to the January 6th Capitol riots.  This is the Lex Freeman Podcast.  To support it, please check out our sponsors in the description.  And now, dear friends, here's Andrew Kalgan.  I tried to color match you, though.  Got the black and white going.  I went to Walmart before this and got the Wrangler shirt with the Texas Longhorns tee.  Is that where you shop, Walmart?  Generally, yeah.  I'm a Target man myself.  There's no way you get those suits from Target. So you're saying it's a nice way to compliment a suit.  I think you go men's warehouse, if not further.  I think you would be wrong.  You go further.  No, the other direction.  You got that from Target.  Not Target.  I was joking about Target.  I like Walmart better.  It just felt like a funny thing to say.  No, it was funny to me as a gift. Yeah. When I was on tour, I had these $2,700 Cartier glasses  that I got for  a lot of money. $2,700.  Like sunglasses?  Yeah, but they were really embarrassing.  But I was on tour, so I just felt like I could do anything  as far as fashion choices.  But looking back at pictures from myself in that era,  I'm like, God. So that was a symbol of...  of the fame got to your head i think so yeah i think fame getting to your head if you spend more  than 100 bucks on sunglasses you've officially gone off the deep you've crossed the line totally  and that's where you uh go back to walmart to humble yourself i really love walmart in fact i  moved to austin because i was at walmart and a lady said that i look handsome in a suit and i  was like that's it i love this place she just said it for no reason whatsoever. This older lady just kind of looked at me and with this like genuine sweetness just said, oh, you look handsome.  She's not wrong, man.  Thank you.  That's part of your whole swag, though.  Yeah, the suit thing.  Yep.  Anyway, what was the first, if you remember, first recorded interview you did?  Well, like my first grade teacher, Mrs. Claudia,  this is back in the day, like I was telling you, we just asked her about her life in Columbia and  stuff like that. But I didn't really get into actual journalism until my ninth grade year.  I had no idea I had an interest in it. Before then, I wanted to be a rapper. It's all about  hip hop and meditation and picking psilocybin mushrooms in public parks and stuff like that.  That's what I was into.  That's a lot.  Psilocybin, meditation, rap, public parks.  Yeah.  I was making like conscious rap music.  I was to the point where I had like four dream catchers hanging above my bed, Alex Gray painting on the wall, tapestry on the ceiling.  just scribbling rhymes down all the time.  So you said somewhere that you sucked at school.  Okay, well, let's step back a little bit.  So I had this amazing journalism course in ninth grade.  I went to an alternative high school, and the teacher was named Calvin Shaw,  and he was just like, I ended up taking his class all four years,  and he used to let me actually leave school.  Like, I didn't like going to school,  so he'd let me basically go around Seattle and do  different interviews with people as long as I could come back by the end of the day and write  a story for his class. And he'd mark me as present. So the first article that I wrote was about the  Silk Road and the deep web. Because, you know, as a ninth grader, when I discovered the hidden wiki,  I thought that I was like really tapping into like the most secret society elite level black market in the world.  And so if you remember, they had that hidden wiki link that was like hire a hitman, you know.  And so I messaged them and I was like, all right, you know, I want to get someone killed at my school.  Like how much is it going to cost me?  And I published my interview with the hidden wiki hitman who was probably a fed or something.  But who knows?  And my first article was called, like, Inside the Deep Web, a Conversation with a Hitman.  That's nice.  Yeah.  I mean, you were fearless even then.  I mean, I was hiding behind a Tor browser, so there's not much fear to be had.  Oh, so it was anonymous.  It was anonymous, but I did publish it under my name, so you're right.  I could have been in danger. I also saw that you took too many shrooms when you were young, and that led you to have hallucinogen-persisting-perception disorder, HPPD.  Can you explain what this is?  Well, that condition is classified by persistent visual snow, floaters, morphing objects.  Like, I see them right now.  I see them all the time.  The snow is in the room.  The snow is definitely in the room.  It's all over you.  And basically, it wasn't that I took too many shrooms. I think that it was, I took,  I took about an eighth of senna essence mushrooms, which are the ones that come from the earth instead of cow shit. And I took an eighth of those at my friend Toby's house, which is a normal  amount, but I was in eighth grade. So I woke up the next morning with these extreme visual distortions  and I thought that it would go away.  I tried to make it go away, but there's really no cure for HPPD.  It's a lifelong condition, so it's just a matter of dealing with it  and realizing that it is only visual.  So when people ask me, hey, I have HPPD, how do I cope with it?  I say remember that every other sense that you have, what you can hear,  what you can taste, you know, your feet on the ground, you're still on earth,  you're still on earth you're still here well he said it's only visual and yes  gratitude for being alive at all yeah it's great but you said that this led you into some dark  psychological places like depersonalization disorder yeah depersonalization is the feeling  that you are not real but that reality still exists derealization is the idea that reality  itself is an illusion  created by your mind and that you're the only person alive and that everything  that your brain is projecting to your visual cortex is a lie and that you're  the only living human being. Both are pretty intense.  HPPD creates both of those things and so when I've talked to people who have the  condition it's really either or but more than 70% of people with HPPD  fall into either category. They're both coping mechanisms for the, I don't know what really  happens. I talked to a researcher once named Dr. Abraham. He lives in upstate New York.  He's the leading scientist when it comes to HPPD research. He's the only one who actually  seems to care about finding a cure. And the only known treatment right now is alcohol and  benzodiaphines. That's not good. Right. So alcoholism, something that came into my life pretty  early. Alcohol abuse as a result of  that experience because that helps with the visual  symptoms, makes some of the static  go away. Never tried benzos  though. So can you explain  to me where in that spectrum you are?  So do you  sometimes have a sense that you're  not real? Sometimes. And something else  is not real? Like the reality're not real? Sometimes. And something else is not real?  Like the reality is not real?  Yeah, I experience it all the time, you know.  But like I said, my job helps with that because I get to feel like, you know,  when you seek out extremes to a certain extent and you put yourself on the front lines of intense events, whether it be politically or socially or just dive into deep fringe subcultures,  you get this feeling that you're real.  And being filmed is also confirmation, if you can look at the MP4 file,  that you're in fact living here on Earth.  confirming that you were in it with reality by watching yourself on video.  Exactly.  So is that basically the engine behind all the extreme interviews you've done?  Well, I got HPPD around the same time that I began this journalism course in ninth grade.  So I sort of always used journalism as a therapeutic mechanism to deal with some of these symptoms,  especially depersonalization.  There's some pretty good illustrations of what  it feels like. It kind of feels like you're trapped behind your eyes or that you're just  this nebulous soul that's trapped in a flesh suit that you're not really a part of. You're sort of  puppeteering a flesh and bone skin suit. Trapped or just the ability to step outside of yourself?  You feel like your soul is not something that is connected to your body. It's something living in your head. It's really hard to explain to people who haven't  gone through derealization or depersonalization. But if you go on support groups, they always say  like, how do I break free from behind my eyes? Like dark stuff like that. So you're trapped.  I mean, there's a higher state of being through meditation that you can kind of step outside of yourself. But this is not that. Unfortunately, it was kind of the meditative path or, you know,  the Eastern path that I took and kind of fused that with psychedelic culture in Seattle  that took me down the psychedelic use rabbit hole in the first place.  So, like, I'd say it all started with Siddhartha.  Siddhartha, that's a good book.  Have you done some since then?  No, I don't really do psychedelic drugs.  But, like, a lot of people think that I'm against them, which I'm not.  It just doesn't work for me.  If it works for you, I'm sure that can be really fun.  Especially, I know there's lots of, like, therapeutic uses for acid and ketamine and psilocybin, but I personally abstain from those kind of anything psychotropic. I try to stay away  from drinking a bit. Well, yeah, I mean, I didn't drink at all before I had the HPPD stuff and I  would have drank later in life, but definitely like 14, 15 every day after school, I drink a  40 ounce of Mickey's. It's like a, it kind of looks like old English, but the bottle's green and it has a Horn hornet on the side of it. It just kind of became a ritual just to deal with the anxiety of that situation.  And it made the snow go away?  Yeah.  Alcohol really works to suppress HPPD symptoms.  So you said you hated classes in school, except that journalism class.  Okay.  We need to clear this up because on my Wikipedia page, for some reason, for Andrew Callahan early life, it says Andrew hated every single class except for one.  So I've had a bunch of teachers who are super cool. Like this guy, Tim, my astronomy professor  in ninth grade, Mrs. Zanetti, my creative writing teacher in sixth grade. And this really cool dude  at my college in new Orleans named Charles Cannon, who taught me a class called new Orleans mythology,  my three favorite classes besides my journalism class. And they all hit, they all hit me up and they're like, Hey man,  Saul,  you said you hated every class.  Sorry,  I couldn't be everything that you wanted me to be.  Yeah.  And so I just want to say shout out to all those teachers.  I didn't hate every class.  The point that I was making is that being forced into the institution of school so young and having to take common core classes like biology, dissecting frogs, history of the Han Dynasty, stuff like that that I didn't want to learn, but I had to learn multiple times.  I mean, I learned about the dynastic cycle in ancient China, three separate  times at three different schools. And I was like, who is writing this curriculum? And why is it so  important that I understand this process? Yeah. The part that makes school difficult, especially  in college, is that you have people just going to school just to get the degree who don't really  know exactly what they're interested in. And they don't even have time to figure that out because they're in a business program or a communications program with no specific interest.  Well, I think if you want to do school right, take on every single subject that you're forced into.  It's like the David Foster Wallace.  Just be unboreable by it.  Just really go in as if ancient Chinese dynasties are the most interesting thing you could possibly learn.  And it is somewhat interesting, the Silk Road and the Great Wall and Terracotta, the Silk  soldiers and stuff. But I'm just saying, like, when I got to college, I signed up for journalism  school, right? And I didn't get to take a media class until the second semester. And, you know,  I had to take everything prior to that. And I'd already spent so much time. I just think the  excruciating boredom of schooling left a bad taste in my mouth. But there was individual classes that  I liked a lot. Yeah, there should be some choice. Or maybe a lot of choice, even at the level of high school, for what kind of classes you pursue.  Yeah, for sure.  And you're also saying so Wikipedia is not always perfectly right.  No, but it's just interesting because, like, I've said so much in podcasts,  but that's what they isolated.  And I've gotten that question before, which I understand.  It's the first thing on my Wikipedia page,  but it makes me sound like a super hater.  Have you ever seen this Instagram page called Depths of Wikipedia?  Oh, it's great.  Oh, it's so good, dude.  You said you love journalism.  What did you love about journalism?  I mean...  What hooked you?  On a basic level,  everybody wants media coverage, right?  Everyone likes to be on camera  and get exposure  for whatever they're doing.  like a portal for exposure for people allows you to be on the front row of everything that you want  to be a part of. You get to be in the front row for history as it's unfolding because everyone  wants to be covered. So being a journalist gives you a ticket to everywhere that you want to go in  life. And so it allows you to step into different realities almost and then go back to yours. And  it just keeps life interesting. Buy the ticket, take the ride. Hunter S. Thompson, is he up there as one of the influences?  Who are your influences?  I think the early Daily Show was so good.  Sacha Baron Cohen, huge influence.  I mean, that was like the Ali G. Show especially.  I think Louis Thoreau's broadcasts on BBC were great.  I was really into Hunter S. Thompson too, but not really until college.  I really like a particular Hunter S Thompson book called the great shark hunt, um,  where he covers the Ruben Salazar murder by LAPD or LA sheriff's department in,  in, uh, in Boyle Heights in the, in the seventies and his,  his relationship with his lawyer, Oscar Acosta.  And that whole saga is great fear and loathing. I like,  but not as much as his straightforward reporting.  Cause there's the  like saying he's taking drugs and seeing shit.  And there's the other side of him, which is like an actual reporter  interested in telling a story that has news value.  So it's two different lanes for him.  There is something about you that makes people want to say  you're the Hunter S. Thompson of this generation.  And I don't think they mean the drugs.  I think they mean some kind of nonstandard willingness to explore the extremes of humanity.  And like almost a celebration of the extremes of humanity.  Yeah, well, that's a very kind comparison.  I'll get there one day, maybe.  I just went to Aspen on a little Hunter S. Thompson recon trip to go check out the Woody Creek Tavern,  which is the spot that he, it was like his bar near his cabin.  And it was pretty cool to see.  Unfortunately, it's kind of turned into not a dive bar now,  but it's a sit-down sort of country restaurant.  But it was cool.  But I expected to see a bunch of gnarly Hunter S. Thompson types doing speed.  Just doing drugs.  I mean, drugs and alcohol is all part of it somehow.  Yeah.  So it opens a gateway to a deeper understanding of humanity.  But I will say, though, like, as someone now who doesn't party like I did when I was younger...  It's not as important as I thought it was.  I'm conflicted on this.  I'm good friends with a lot of people that say alcohol is really bad for you,  and I believe that too.  But there's something that I just, as an introvert,  as a person who has a lot of anxiety,  for me alcohol has opened doors of just opening myself up to the world more oh i'm actually a fan of of alcohol  moderate drinking but i'm saying like my life before i would say 2019 2018 especially there  was the chaos on camera but then there was my private life which was like chaotic partying all  the time oh i see and i i convinced myself much like hunter did that that was the secret sauce  that in the core the spiritual in my spiritual core that gave me the creativity.  But then I cut out a lot of that stuff, and I'm just as creative.  And it's interesting that a lot of, I think, one of the hardest parts about addiction is that if you're a functioning, highly creative addict of any kind,  your brain and the addictive part of your brain convinces yourself that it's all part of the cross-purpose and that it has this symbiotic,  inspirational thing going on,  but it's not true.  It can be, but it's typically not.  Yeah, it's not a requirement.  You can sometimes channel, you can sometimes leverage all those things for your creativity,  but the creative engine, it lives outside of that.  Have you read Hunter's daily routine in the year up to his death?  It was like 15 grapefruits and eight ball of Coke and just a certain amount of shotgun shells  for him to fire into the sky every morning.  There's no way, and he didn't do anything creative in those final years.  So the creativity goes away and gradually you just become like a party animal, like  Andy Dick.  A caricature of yourself.  Yeah.  I mean, that's why life is interesting.  You make all kinds of choices, and sometimes you can have, create works of genius in a  short amount of time based on drugs and no drugs.  Einstein had that miracle year where he published several incredible papers in one year, 1905.  Did he do drugs before that?  Lots of coke and...  I was like, I believed you for a second.  I'm like, did Einstein have blow?  I don't think he did.  How do you think he gets that hair?  Come on.  It's true.  I'm just asking questions.  High confidence hair.  Look into it.  You know what I mean? Yeah. Well, no, he's a well put together,  sexy young man.  The hair came later.  Yeah.  Was Albert Einstein attractive as a teenager?  That's not teenager.  Was he attractive as a young man?  Sexually attractive?  I don't,  I mean,  I'm turned on by Einstein at all ages.  I don't.  discriminate but are you more turned on by the work that he did or his physical being  uh no sometimes i fantasize what it would be like to be in the arms of einstein i could even get  that out yeah uh in the arms of einstein yeah just just i want to feel safe it's a good idea  for a rom-com to be a little more serious like general relativity that space time can be unified and curved by gravity  is an incredibly wild and difficult idea to come up with.  It's a really, really difficult thing to imagine,  given how well Newtonian classical mechanics physics works  for predicting how stuff happens on Earth.  To think that gravity can morph space-time, both space and time, and it permeates the entire universe.  It's a field.  It's a really wild idea to come up as one human on Earth to intuit that is really, really, really different.  And it's really sad to me that he didn't get a Nobel Prize for that.  Was there people saying he was crazy when he was around?  Or was he universally recognized as like an OG of this?  No, I think once the papers came out, he was widely recognized as a true genius.  But before that, he wasn't recognized.  He had a really difficult life.  So back now, where does a black hole go, like after something gets sucked into it?  You mean is it a portal to another place, that kind of thing?  Yeah.  No.  Well, we don't know.  It could be.  It could be that the universe is kind of like Swiss cheese full of black holes.  There's something called Hawking radiation where because of quantum mechanics,  the information leaks out of a black hole.  So it is possible to escape a black hole.  There's a lot of interesting questions there. I hope we get to the bottom of that.  And there's a supermassive black hole at the center of our galaxy, which doesn't seem to scare physicists, but it terrifies me.  Oh, yeah, for sure.  Astronomy can be terrifying.  Yeah, we're all, like, orbiting.  I mean, we're not just orbiting the sun, but the sun is part of the solar system, is part  of  He flew his own rocket.  Wow.  That's pretty cool.  Astronaut that's been to deep space now.  Well, maybe I've spoken to an alien that just hasn't admitted it.  I want to do a research paper or like a report about space madness.  You know, it's supposed to be this like torturous feeling that you get when you look away from Earth and into the abyss after you've exited Earth's orbit or whatever.  Because there's one specific psychiatrist who knows how to deal with space madness,  and I want to figure out how and interview people with it.  Is this a real thing?  Yes.  Is there a Wikipedia article on it?  Yes, look up space madness treatment.  Now I don't trust Wikipedia after what you told me.  I know.  They think I hate classes.  I thought you meant more about the fact that you're isolated out in space,  that we need social connection, and it's difficult.  Yeah, I think it's just a feeling of extreme insignificance that you might get sometimes when you look at the night sky, but it's that times a thousand. It's like an existential void that's created after looking into the abyss and then realizing how small Earth is in the grand scheme.  You just start to really have a strange new perception about the pointlessness of existence.  I don't need to go to space for that.  I mean, only a handful of people have been to space, but I'm sure they're all pretty well off.  So the psychiatrist has to be in the multi-millions.  Well, technically, we're all in space because Earth is in space.  So I wonder if you have to go to space to talk to the psychiatrist.  psychiatrist. Yeah, probably so. Well, technically we're all in space, so he can't, that's a boundary  he can't have. But not everyone believes that as you've seen from my, my work probably. You're  right. And that's, those are important people that are asking important questions. Yeah. Um,  you hitchhiked across us for 70 days when you were 19. Right. Tell the story of that. Well,  this sort of connects to what I was talking about with the boredom of school and these common core classes.  So after my first year of school where I lived in the dorms, like an old school dormitory building at a school in New Orleans called Loyola University, I wanted to just do something.  I felt so bored.  I was working for the school newspaper for that whole first year.  It was called The Maroon.  And I didn't have the ability to write my own stories.  Like I had to defer to an older editor  and they would give me stories to write about.  And they were all about like on-campus happenings,  like the Pope visits New Orleans  or glass recycling to be restored in the French Quarter  or hoverboards banned on campus due to safety concerns.  and it just kind of felt like, all right, I kind of wanted to be a gonzo reporter.  I'm not sure if working my way up to the traditional newsroom hierarchy is going to get me to that point.  So I started reading a bunch of old hobo literature, you know, like post-World War II vagabonding stuff.  And there was this book called Vagabonding in America by an old hobo, Ed Byrne.  And I read this and it just basically, obviously some of it was outdated.  They had stuff in there like the hobo code, like, oh, this moniker on the side of a fence means this person has free soup or something like that. They didn't have stuff like that. But what it did tell me,  it told me about train stop towns like Dunsmuir and, you know, places in Montana where there was  a friendly attitude toward drifters. And that still persists from the sixties and seventies to this day.  Even though in my opinion, movies like Texas Chainsaw Massacre have ruined hitchhiking culture  in America because now everyone thinks you're going to, you know, decapitate them if they pick  you up. So after my final day of courses at Loyola, I literally left all of my belongings  inside my dorm and took the streetcar to the Greyhound station, got a one-way ticket  to Baton Rouge. And I was like, I'm going to hitchhike across the whole country back to Seattle.  with no money.  And that was the plan, and it worked out.  I love it.  I traveled across the United States before in a similar kind of plan.  Were you on the Silver Dog?  It's the Greyhound bus.  Greyhound is pretty nice.  That's a step above hitchhiking.  That's way better than hitchhiking.  Hitchhiking, Greyhound, Amtrak, airline.  Amtrak, no, that's elitist.  What's in between Greyhound and Amtrak? A car.  That's what it is.  Yeah, it's a car, yeah. A car.  A shitty car.  Okay, cool.  I lived in a shitty car.  You lived in a car?  Yeah, when I was driving across the United States.  Solo?  With a friend, some solo.  And I would have, I would eat cold soup.  I love cold soup.  What I like is the cold chickpeas in a can.  You get the water out and just dump them in your mouth.  Yeah.  Those are good.  Beef jerky, kind bars.  Kind bars are really good for the road.  Yeah.  I mean, all of that is great, but too much of it is not great.  Great. Like too much cold soup. Not great. Too much beef jerky.  So what was the route you took? Was it Chicago across or was it Philadelphia across?  Philadelphia across.  To L.A. or where?  San Diego is where we ended up, but it was a zigzag and went up to Chicago and then all the way down to Texas.  So you went Philly through Appalachia up to the Midwest.  Yeah.  Did you cut over like through the Southwest down to San Diego?  No, no, no.  I went straight down to Texas, all the way down to the Midwest.  But did you cut from Texas west through New Mexico and Arizona to get to San Diego?  Yeah.  That is the best road trip place.  Interstate 40, like Albuquerque, Flagstaff, Vegas, Kingman, the Mojave Desert, Yuma, doesn't get better.  Yeah, and you're a kid, so you don't care, and you throw caution to the wind.  You met some crazy, crazy people.  It gives me some sanity, like whenever I'm feeling kind of out of control or, you know,  like bummed out.  I just remember that the road is still out there.  The open road never goes anywhere, and it's kind of like a, I see like an invisible door in the corner of the room all  of time that makes me more comfortable because I'm like, hey, at the end of the day, if I'm  bummed out, I can go hit the road and I'm sure there's going to be a fun time ahead.  Yeah.  Get that Greyhound ticket and go.  I would say silver dog half because sometimes I got to ride the dog when no one will pick  me up.  There's some places in the country where no one's going to pick you up.  Yeah.  Kansas, Missouri, they're not going to do it. Maybe you're not charming enough. Have you thought about that? I was 19, fresh, clean-shaven.  Yeah.  I was pretty charming, I'd say. All right.  But the older you get, the harder it is to hitchhike because they think you're like an escaped convict or some type of like psycho wanderer.  And some of these people are like what we call punishers.  It's people who never stop talking.  And so they see someone hitchhiking and they're like, yes, I'm going to talk at this person. And you can tell their eyes are wide. They're like, what's up? And you're like, oh shit. So it's six hours of just like, oh, cool. Nice. That's rough. Yeah. Yeah. You're right. You're right. I like people that  are comfortable in silence. Yeah. And then that also raises the question, are they about to kill  me? You know what I mean? I think that's a you problem. You know,  like a day laborer.  It was almost all Mexican day laborers who picked me up.  Oh, interesting.  Because I think that in some places down there,  that's a typical thing to do, hitchhike to work.  A lot of people don't have cars,  but they still have to get to their jobs.  So a lot of people ask me, hey, where should I drop you off?  Where's your job at?  And I'm like, my job is to explore.  And they were down with it. Because he just said, I'm traveling across the United States, and I think people love that idea, and they want to help.  They're romantic, because they also have that invisible door.  Everybody has that invisible door, and I just want to go.  So you know what I'm talking about.  Yeah.  It can anchor you a bit, just to remind you that every pattern that I've fallen into is voluntary, and it's for my own stability and mental health. Well, that's why I'm like renting everything and I'm making sure like tomorrow I can just go.  I gave away everything I own twice in my life.  Just very like, I'm ready to go tonight.  Let's go.  What's the hardest item you've had to part with in this experience?  There's nothing.  You've never had a material object that was really hard to let go of?  No.  So you'd give that watch to somebody  If it meant anything  No, this, you're right  You're right  That's probably the only  I've never had to let go of that, though  Yeah  That's the only thing I own  This means a lot to me  But everything else  But then, again  Listen, because  Okay, this watch is given to me by Rogan  Who's become a close friend  But, like, whenever I romanticize the notion that this watch means a lot to me, he's like, don't worry about it. I'll just get you the same one again.  Yeah.  I was like, god damn it.  It's a pretty sick-ass gift, though.  Yeah, it's pretty sick.  I'm not usually a gift guy, but when somebody you look up to kind of gives you a thing,  it's a nice little symbol of that relationship.  But other than that, no.  But even this, whatever.  The relationship is what matters.  The human is what matters, not the... I agree 100%.  You had something like this?  Not really.  I mean, there was a hard drive that I lost  that had all of my childhood pictures on it  and stuff like that that I think about all the time  because I left it on a train.  And certain memories, you think about it,  you just get pissed off and think to  I have dreams about reuniting with the hard drive.  You and Hunter Biden have a similar kind of dream.  I don't think he wants to reunite with that one.  Okay.  It's crazy.  Like, you know, all he did was smoke crack, right?  Or was there more stuff going on?  I think there's prostitutes involved.  Oh, okay.  Whatever.  I think you got to look into it.  I think I have to look into it too.  I don't know.  Was Kerouac, Jack Kerouac, somebody that was an inspiration at all in this road trip?  Did you even know who that is?  The B generation?  I didn't know who it was.  And then after I did the – ultimately, I wrote a book about my hitchhiking experience years later.  And everyone was like, have you read On the Road? And then On the Road, I probably heard the title of that book every day,  at least 10 times for two years. And, um, I'm sure Kerouac is a great guy. I mean,  I just don't, I'm not too familiar with the beat generation.  It's a great book. It's a, you read it or no?  I refuse to read it. People even have gifted it to me and been like, Hey man,  you're going to love this one.  And I'm like, is that on the road?  If I honestly, people have given me a book with wrapping paper on it.  And they're like, this is right at the rally.  I was like, that's fucking on the road, isn't it?  Give you a different cover.  Yeah, no, I'm like anything but that.  But I'm sure it's a great book.  It's just the comparison thing drives me crazy.  Respect.  Big respect to Kerouac.  Would never speak down on the whole anyone in the beat generation what are some interesting moments you remember from that those 70 days man it was so much i mean getting mistaken for a gay prostitute on my first hitchhiking ride in louisiana was pretty funny where did you come from and where did you go well  i mean the journey began in baton rouge and the first destination was houston which is about four  and a half hours west um on interstate. So I'm in Crowley, Louisiana.  I'm on the side of the road.  And I guess this was a cruising truck stop that was known for being a place where male lot lizards would go to procure clients.  And I was there.  Lot lizards are –  It's a derogatory term in trucker culture for a prostitute who hangs out at the Loves or Pilot Flying J.  Okay.  large interstate truck stops now trucker culture as it once was is pretty much finished because of  the live stream cameras they have inside of the trucks now so you can't snort pseudofed or  pick up anybody you can't even pick up a hitchhiker or you get fired killed all the romance  yeah definitely the truck that the old school outlaw trucker lifestyle unless you're an owner  operator with who's not even in a union which is like a real cowboy way to haul loads,  you can't do that.  You were mistaken for a lot lizard.  Mistaken for a lot lizard by a small man from Honduras with a spiky leather jacket covered  in studs.  Nice.  Didn't speak any English, but I thought he was just a nice guy.  And then he pulled over at a...  There's private theaters in the south where they have confessional  booths set up and they have three channels and people go in there and you know it's boring yeah  people go in there and you know please that's right yeah yeah so i thought he was taking me  to one of those i was like all right cool man yeah like you know  If this guy wants to go jerk off, I'm just going to wait in the car.  It's all good.  I don't discriminate.  But then I was like, he buys a booth for me.  And I'm like, okay.  I'm not really in the mood to watch porn with this random guy.  So he gets in the same booth as me.  And he starts jerking off right next to me.  And I'm like, oh, man.  I don't think this is chill.  I'm like, dude, can you stop? He stopped jacking off, and he's like, what do you mean? I thought this is what you want to do.  I have money for you.  What's up?  And I was like, oh, no, I'm just a regular guy.  He was super cool about it.  He started laughing.  He was like, oh, my bad, man.  I thought you were selling something.  I said, no. And he said, oh, it's all That's great. Yeah, we talked about anything except that for the rest of the car ride. That's great. I was just rolled with it.  Oh, sorry about that.  It could have been.  I had about a foot and a half on this, guys.  I wasn't too scared.  I also had, like, a knife in my pocket.  But I didn't want to stab him, especially not at a place like that.  And you were still.  That didn't, like, leave a bad taste  who among us have not been mistaken for a lot lizard it's a fact you heard it here first  what else what what some interesting beautiful people that you've met well i used to have a  couch surfing to find places to stay now you can only submit like five couch surfing requests a day  unless you're a premium member which means you also host people couch surfing still around yeah  yeah totally oh nice but it's evolved obviously into a different thing airbnb is a kind of competitor to that right  couch surfing is free though right so couch surfing they call it like the cs community so  basically there'd be these like couch surfing super hosts in different cities like there was  one in santa fe this firefighter dude who had like 15 other couch surfers there chilling nice  um so i would do it everywhere a lot of them were Catholics, you know, so it was their way of giving back.  A lot of them were nudists, and so I didn't realize that there's a small little section  at the bottom of someone's couch surfing profile that says clothing optional.  Yes.  And that means if you go there, I thought it meant like it's cool if you walk to the  underwear no if you go there everyone's going to be butt naked so i made that mistake a few times  not that i'm anti-nudist but i didn't want to you know i wasn't ready to take that leap of faith  and uh yeah it was just great couch surfing hosts were amazing yeah that was just great it was this  constant thing where i felt like wow people are so welcoming i'm not having to pay them a dollar  for this experience yeah i love couch surfing for like For me, being an introvert, just crashing on a person's couch, being essentially forced into a great conversation is great.  Yeah. The one thing that gets exhausting about hitchhiking is constantly thanking people.  Being in constant superficial gratitude everywhere all the time.  Like, oh, thanks for letting me sleep on your couch thanks for the food yeah part of the reason i wanted to live in an rv later in life is to avoid having to constantly  live in this like thanks so much type of frequency because it's exhausting to constantly hey man  thanks i think the shallowness of that interaction is exhausting not just the not thanks yeah it was  a true favor of course i love giving people gratitude for that but just this thing where  everyone who picks you up is you know you you get eight rides a day. You're like thanking eight people a day,  like they're the second coming of Jesus. You start to feel a little bit debased.  What'd you learn about people from that?  that journey. That's your first time really kind of going into it. The American public is just so  kind overall. I mean, they're so like embracing depending on who you are. And specifically,  though, the Christian family people of the U.S. who drive in minivans and have that fish sticker  on the back where it's like Jesus fish and then they have the family sticker, you know, where each member of the family is a stick figure.  Those people never picked me up and would flip me off with their whole family.  Sometimes they would throw full Dr. Peppers at me as a family while I stood on the side of the road.  As a family, together. They would yell shit like, go to hell, hippie, when I was on the side of the road.  And so it's weird that the most charitable Christian American family values people never gave me any charity or even conversation.  They were antagonizing me and saw me as like a hippie leftover from the 60s who needed to go to work, go to Vietnam.  I don't get it.  Yeah.  But the people who really extended a hand to me is people on the margins.  Yeah. People working on seasonal visas, people whose cars have, you know, less than a quarter tank left, people struggling with addiction who saw me struggling, or at least they thought that I was because they assumed I was hitchhiking, not out of adventure, but because I had no car and were willing to sacrifice their day almost sometimes to take me exactly where I needed to go.  That's beautiful, man. I've had similar kind of experience that people who are struggling  the most are the ones  who are willing to help you  when you're struggling.  Yeah.  There's people like  in religious context  and other kind of communities  that just judge others  because they've kind of  constructed a value system  where they're better than others  because of that value system.  And that actually has a cascade  that forces  you to actually be kind of a dick.  Yeah, I never thought about it that way. It's so true.  Do you think about morality and religion a lot?  Yeah.  Yeah, I've been to certain parts  of the world where religion is really a big  part of life.  I'm just...  I'm always skeptical about tribes of people that believe a thing and they believe they're better than others because they believe that thing.  That could be nations, that could be religions.  Yeah.  I mean, in Ukraine and in Russia, I've seen a lot of hate towards the other.  Yeah.  And that hate, I'm always very skeptical of because it could be used by powerful people to direct that hate uh just so the powerful  people can maintain power and get money this kind of stuff it's a scary thing to see how easy it is  for high up political people to mobilize the hate of just the average working person and can almost  convince them to sabotage their own countrymen who they share more in common with than the  politician they look up to just to advance the agenda of one party.  That's what we're seeing now.  Are there some places in America that are better than others?  Can you speak negatively of, like, aforementioned Joe Rogan talks shit about Connecticut and nonstop?  Can you pick a region in the United States you can talk shit about?  Talk shit about?  Oh, for sure.  I mean, from that experience.  Let's just narrow it down to that.  Oh, Colorado.  Oh, jeez.  Really?  Yeah.  I know so many people that love Colorado.  Dude, Dallas, Denver.  I used to think Phoenix sucks, but I love Phoenix.  now. The way they build these cities to just be  so circular and massive, it's just like, stop.  You don't like circles? I like grids, man.  Oh, you're a grid guy.  Manhattan, New Orleans, San Francisco.  What is it about grids that bring out  the worst in people?  Circles is where everyone's just  vibing out.  The grid gets people locked in and hateful.  I don't know, man.  I've never heard anyone talk shit about Colorado, I have to say. It's kind of refreshing. It provides a necessary balance for the Colorado Wikipedia page.  Yeah. Oregon, too. I got problems with Oregon. Oregon. Yeah. Well, here's the issue. You have,  and I don't like just calling people racist because it's kind of like a two-dimensional  insult, but you have the most racist state with the most psychotic anarchist city in the middle of it. What is going on up there?  How did this happen? The yin and the yang is so extreme that there must be something in the  bulamit. What do you have against anarchism? I have nothing. I used to be an anarchist. When I  was in eighth grade, I had this friend named Mads, who was part of a group called Seattle  Solidarity, which is like an Antifa precursor. So I grew up going to black bloc protests and  I mean, there was a particular shooting, the murder of John Williams, who is a Native American woodcarver in downtown Seattle.  He got killed by a Seattle police officer named Ian Burke.  John Williams was carving a pipe from a wood block with a pocket knife.  He's deaf in one ear.  Officer pulls a gun on him and says, put it down.  He doesn't hear him.  He shoots him six seconds later.  on him and says, put it down. He doesn't hear him. He shoots him six seconds later.  So that police-involved shooting is what instantly turned me into a very critical of law enforcement kind of person when I was super young. And so as someone who used to see this guy who got murdered,  he was a 55-year-old man, I used to see him around Pike Place where my mom lives. It's a  public market in downtown. That, to me, put me into the anarchist political sphere,  just channeling the anger of that experience. And the officer got no charges, by the way,  you can look up the video, it's horrific, you know, and it didn't get reported. The officer,  I'm pretty sure is still active duty. And so it's like situations like that,  early in life channeled me toward political extremism. But I grew up to realize how, um,  incompatible that  anarchistic worldview is  with reality and with  American society. It can only exist in a  small little chamber.  You can't apply that to the industrial  heartland of the country. And I think also  anarchism, so  I've gotten to know Michael Malice who's written  quite a bit about anarchism. And it  also exists as a body of literature about  different philosophical notions that kind of  resist the state, the ever-expanding state in different kinds of ways.  And it's always nice to have extreme thought experiments to understand what kind of society you want to build.  But implementing it may not necessarily be a good idea.  Yeah, I mean, Emma Goldman, I'm a huge fan of her writing.  Also, the prison abolitionists that are associated with the anarchist movement, Angela Davis, Ruth Wilson Gilmore, all that stuff, influential.  I still adhere to a lot of those principles when talking about stuff like radical prison reform and stuff like that.  But just I drifted more toward...  having a more open mind as I got older.  Extremism implemented in almost all of its forms is probably going to cause a lot of suffering.  Yeah.  You worked as a doorman on the, I could say, legendary Bourbon Street in New Orleans.  That's right.  Where you saw what you described as, this might be another Wikipedia quote, by the way.  This is where I do my research.  Does it say hellish scenes?  Hellish scenes in quotes.  Wikipedia is damn right about that.  All right, thank you.  That's a win.  That's one in the win column.  So yeah, tell the story of that.  What's it like to work on Bourbon Street?  What kind of stuff did you see?  I mean, I was a host at a fine dining restaurant on the corner of bourbon and Iberville. So that's the first street.  If you go from canal street onto the quarter.  So this is like across from like a daiquiri spot.  It's the middle of the tourist corridor of new Orleans.  And the spot was kind of like,  and kind of a tourist trap.  It was called bourbon house.  The food was good.  Chef Eric,  I don't want you to see this and think,  but,  you don't make good and dewy sausages, but it was overpriced. And so I had to, we had to maintain  this like fine dining facade on a street where almost everyone is like throwing up fighting or  is half naked. So there was this policy. We had these giant glass windows next to the tables.  So if you're eating at a bourbon house, you can look out onto bourbon street and you can  see as you're dining a full panoramic view of all these partiers throwing beads,  boobs, all that.  We had this policy where if we're serving someone, we can't look onto Bourbon Street if something crazy is happening.  So if there's a fight or something like that, we can't look, right?  So there is a dude, remember, I'm fucking serving a table.  There's a dude in a Batman mask, butt naked, with 12 pairs of beads, just jerking it.  Yeah.  Back to jerking it.  He's jerking it.  Right.  And every, every single person at the restaurants looking out there, like, look, they're taking  pictures.  And the manager, Steven looks at me, he's like, keep your fucking eyes on the table.  So I'm serving these people, you know, I'm like, you want to eat red beans and rice or  would you like some Cre  escorted him further down Bourbon Street.  But, you know, I would get off work at around midnight every night,  and that was when Bourbon Street is at its most chaotic.  And so I lived in the French Quarter as well.  So I lived about 12 blocks down Bourbon in a small Creole cottage,  a cute little, like, orange, old-school New Orleans one-story spot.  I lived in the attic above these gay meth dealers named Frankie and Johnny.  Oh, wow.  And so I would get off work, and I would basically have to walk through this battlefield.  I mean, it was a battlefield.  Getting home was out of the Warriors movie.  It was almost impossible.  The best of humanity on display.  Yeah.  It was like Kensington, Philadelphia, but just alcohol.  You know what I mean?  Oh, it's all alcohol.  But it's a lot of visitors, right, from outside?  Almost all visitors.  Yeah.  And that kind of would set the flow for the weekend.  For example, if the Raiders were playing the Saints, Raider Nation, and they do not play around.  If it's the Patriots, that's a whole different crowd.  They think they're better than everybody else.  Yeah.  Well, they technically are better than everybody else, but yeah.  People from Massachusetts aren't like the cream of the crop in terms of like American superiority.  Strong words, yeah.  No offense, but I mean.  No, I'm sure they won't take that as much.  They are good at fighting, though.  I'll tell you that.  All right, great.  New England has hands compared to some places.  Which places are those?  Colorado?  Colorado has no hands.  Yeah. The West Coast, not too much hands.  That's why you feel safe talking shit about Colorado.  But if you get to the corn-fed parts of East Colorado, these guys got hands bigger than my head.  They'll beat the shit out of me.  But anyways, I'd walk back to my house on Bourbon Street, and I would be sifting through this battlefield. And I had a friend at the time who was like, yeah, we should do a taxi cab confessions type spinoff where we ask  people to confess a deep, dark secret. And we posted the next day. And so we tried that and  it went viral on Instagram instantly. It was mostly incest stories, people admitting to incest. I know  it's a common Southern stereotype, but there's some truth to it. There was some murder confessions  That was pretty crazy.  We never really posted any of those.  How did you get people to confess?  Pretty easy.  And New Orleans has a homicide solve rate of like 22%.  So, I mean, most of the time, they'll just tell you.  I remember I was walking down Bourbon and I asked this kid, I was like, what's your deepest, darkest secret?  And he told me, he's like, I just smoked a dude in the Magnolia.  It's a project housed in the third ward.  Project development. And they said, I just smoked a dude in the Magnolia playground for touching my sister, molesting his sister.  And I was like, what?  And he's like, yeah, look it up.  And I was like, all right, hold on.  And it was like, man found dead in Central City playground.  Like, appeared to be homeless.  Shot execution style. So I told the kid, I was like, why'd you tell me that? He's like, man, put that shit out there. Like, I'm trying to go viral. Like, tag me, too. Oh, wow.  I don't think you understand that even if you're a juvenile, he was probably 15, you can get juvenile life in Louisiana for a homicide, even if it's, you know, justified.  So I just deleted the footage in front of him.  I was like, I'm going to delete this footage.  See that trash button?  Little moments like that.  Anything for the gram, I guess.  Yeah.  After a while, though, it became sort of repetitive.  Because there's only so many things that people can confess to that go viral.  Oh, so you were trying to see what...  Well, I mean, there's the incest one.  Some people just say, like, I eat ass.  That was like everyone said that.  Or like, I cheated on someone.  I've seen a surprising number of people on your channel say mention eating ass yeah wait how seriously you said that will live  in my head for the rest of my life that's good yeah i want you i want to live in your head  saying that a lot of people mention eating ass. Yeah. A lot of people do mention that.  Yeah.  Also,  that's kind of where I developed this magnetism for freestyle rapping.  You know,  everywhere I go,  people rap.  Not sure why.  I mean,  as a former rapper myself in middle school and for the first year of high  school,  I think that maybe it takes one to know one, but everywhere I go, people start rapping.  If you and me went outside of this podcast studio and walked around for five minutes, I could find somebody.  That's rapping.  I can tell who raps or who can rap, who has eight bars in their head that they're ready to go.  I think also there's something about you that creates the safe space to perform their art.  Yeah.  The Quarter Confessions series was the first time you saw the suit.  That's when the suit came out.  Yeah, it was kind of like a Ron Burgundy, Eric Andre-inspired type of thing.  Where'd you get that suit?  Goodwill.  Goodwill?  Yeah, always.  Wow.  I was playing checkers, you were playing chess.  Good job.  I mean, Goodwill has a surprising amount of identical gray suits for sale.  Yeah, I've actually gotten suits at thrift stores before.  Yeah, a lot of people donate suits.  I was going for oversized suits, which are the cheapest ones there.  Yeah.  It was like $12 to $25 every time for the outfit.  If I wanted to look super sophisticated, like I'm from another era, I would go to a thrift store.  Yeah. Because they're usually like this.  There's like a...  like the patterns they have.  It's just like a more sophisticated suit,  which is what you kind of picked out.  It made you look ridiculous,  but in the best kind of way.  The tough part about quarter confessions for me is that everybody that was  featured for the most part would more or less regret being a part of the  show.  Yeah.  And that over time just gave me a bad feeling where I was like,  you know what?  I kind of feel like I am doing an ambush interview,  especially a bad feeling where I was like, you know what? I kind of feel like I am doing an ambush interview, especially because I'm presenting as so agreeable, yet the intention is to make something funny.  Yeah. And I get that that's what people do in the satire sphere. I'm sure Ali G and Bruno and Borat did the same thing. And I don't think it's unethical because that's all for the purposes  of comedy. It is what it is. But for me, I wanted to do something different.  Yeah, because there's an intimacy to confessing a thing.  Right.  And then you just don't really realize the implications of that.  And the atmosphere of Bourbon Street is like anything goes.  It's a free-spirited place.  But if you transport that energy digitally to a different place like Colorado, they might look at it and be like...  different place in time, like five years later, right. That same person has a family and stuff  like this. And all of a sudden they're talking about eating ass. Right. Exactly. Kids have to  think about that. Or, you know, imagine if there's a video of your grandma or grandpa out there when  he was a kid talking about eating ass, that's a horrible experience to discover that about your,  you know, respected elder later in life. It's tough. I don't even know where to go with that.  But, uh, is the literally the life. It's tough. I don't even know where to go with that. But literally, the opening question was, tell me your deepest, darkest secret. Yeah. Just come up to somebody like that. Yeah. How  often do you get like a no? How often? What's the yes to no ratio? Well, the weird thing is like,  we don't really extract answers from people. Like what makes a good interview is when they're ready to talk. The more you have to talk and try to get an answer out of them, it's just not a good vibe. So we kind of look for people who appear to be already ready  to talk. Open body language, like they seem confident and verbose, and we approach them  first. There's a look. We wouldn't approach a shy person and be like, come on, tell me.  No. What about a person with pain in their eye?  Oh, yeah, we're interviewing them.  Yeah, so they're ready to talk.  They're just not like...  Yeah.  There's different ways to be ready.  Right.  I see homeless people a lot, and they always look fascinating.  And the ones I've talked to are always fascinating.  Yeah.  We just did a video in the Vegas tunnels.  Obviously, it got taken down by Fox, but whatever.  I was going to make a joke that I didn't see it.  We tried to make a joke that I didn't see it. We try to help a lot of them by getting them IDs. And when I made the documentary, I had this idea that if I, it's a big roadblock for them is getting identification. Without IDs, you can't  check into a homeless shelter. You can't do day labor. You can't qualify for housing, nothing.  So when we interviewed them, they'd basically tell us if I had my ID, I wouldn't be here.  And so we said, okay, we're going to really help this time.  We're not just going to talk to them about their struggles.  We're going to actively go out and get them IDs to the DMV.  So we did that, and, you know, nothing really changed in their life.  And we sat down with a recovery specialist who works directly with them day in and day out,  and he explained to me that he's been trying  and that they have deeper underlying traumas and pain that need to be dealt with far before they even take the steps to enter society as a housed person.  That's a heavy truth right there.  Breaking that shame cycle has to come first because you got to think, right?  Like I'm from a generation that romanticizes vagrancy and homelessness to a certain extent if it's called van life or if it is done in  a way that's sort of like rolling stone willie nelson hit the road people who are above 50 they  feel really embarrassed to be in the spiral of homelessness they feel like failures a lot of  them have kids who they weren't there for that's not the kind of pain that can be dealt with by  giving someone a tiny home yeah it's a good step forward, but for someone to really make a change, they have to want  to change.  And so it's how do you help someone and guide themselves in the right direction?  And if you're too paternalistic and you use shame as a method to get them to clean up,  they're going to end up right where they started.  Yeah. That's a tough truth to accept because a lot of people want a quick fix to things.  And I don't blame people who go out and give bologna sandwiches out to the homeless.  And each case is probably its own little puzzle.  Each person is so complex. Now imagine drug abuse, what that does to the brain.  Yeah. Trauma, childhood trauma. There's so much to unpack.  And then just the belief that they're the undesirables, that they don't deserve to be a part of society  because they failed a fundamental obligation like taking care of their kids.  If we could take a small tangent to, you mentioned this Vegas video, which is fascinating.  It was taken down recently by YouTube or YouTube took it down based on-  Yeah, it was illegal.  Fox 5, I guess.  So the documentary was an hour and 45 minutes.  We used 10 seconds of a news clip that was publicly broadcast by Fox 5 Vegas.  And according to the Copyright Act of 1976, you're allowed to use any publicly broadcast news clip in a transformative capacity in any documentary film or research paper or broadcast or anything.  They specifically, this corporation called Gray Media that controls the TV stations in  almost every small town.  they had lawyers hit up YouTube and YouTube,  YouTube complied with an illegal copyright strike to get our video immediately  removed.  And I'm a YouTube partner.  I'm in the YouTube partner program.  So to think that I wasn't forewarned is it's a bit strange,  but it also smells like corruption to me to a certain extent.  Yeah.  You shouldn't have that amount of power at the very least.  They should have the power to just like silence that five second click maybe yeah but  i'm taking them to court because i i have the means to be able to do so i'm a larger creator  i have an audience i have the financial backing to do it i can't imagine how many people out there  are smaller creators with like not as much consumer of a you know a fan base they can  mobilize against someone like fox 5 or the money to go to court.  So I want to take them all the way there to set precedent for future cases so that these giant  mainstream media conglomerates can't copyright strike documentary filmmakers at will. It doesn't  make sense. Well, thank you for doing that. That's really, really, really important. And  that's really powerful. And it might hopefully empower YouTube to also put pressure on people to not.  YouTube is in a difficult position because there's so much content out there.  There's so many claims.  It's hard to investigate.  But YouTube should be in a place where they push back against this kind of stuff as a first line of defense,  especially to protect small creators.  So what you're doing is really, really important.  Appreciate it.  it man and it sucks that it was taken down are you do you have any hope well i talked to my  youtube partner today and he said that the fox 5 lawyers have two weeks to comply with my  counter-appeal but you know i spent 20 grand on uh human voiceovers in five different languages  i invested probably in total like 70k into this video so even if it gets reinstated the steam's  kind of been taken out of its trajectory but also it's just like a really important video is good for the world.  Yeah, like why the hell would Fox 5 have a vested interest in having the video taken down?  I just hate it when people do that to videos or to creators that are doing good in the world.  Yeah, it's not an expose on the mayor of Las Vegas.  It's an attempt to show the civilian public how to get involved in a local nonprofit and potentially intervene in the lives of the tunnel people.  Well, fuck Fox 5.  The other Channel 5, as you said.  Yeah.  Well, thank you for pushing back.  Amen.  And highlighting it.  Hopefully it gets brought back up.  But yeah, defending other creators.  Yeah.  So that other creators can take risks and don't get taken down for stupid reasons.  Yeah.  So, uh, quarter confessions was written.  No, it was all real life reality TV documentary, but it caught the attention of a larger company  called doing things media.  Yes.  And they contacted me pretty much like a week after I graduated from college in the May  of 2019.  And they said, Hey, like, how would you like to produce a show?  I was like, what do you mean?  They were like, we'll get you an RV.  We'll pay you 45K a year.  We'll pay for gas, for food, for two hotels a week.  Go out there, make content, and we'll be in the background just powering it all.  And that was the birth of All Gas, No Brakes.  Yes.  I mean, All Gas, No Brakes was named after a book that I wrote called All Gas, No Brakes,  The Hitchhiker's Diary, which chronicled the 70-day journey that we were just talking about.  It's a tough book to find, by the way.  Oh, yeah.  There's only a few copies left.  I'm thinking about doing a reprint at some point down the line, but I sold off the last  100 copies like a  So, yeah.  Until then, you guys should go read On the Road by Jack Kerouac.  Yeah.  You should read it.  I don't know if you read it.  If you can't get my book, get On the Road by Jack Kerouac.  It's great.  It's the best.  When's your birthday, Alessandro?  April 23rd.  Okay.  I'm a Taurus.  Come and see it.  Typical Taurus, yeah.  Yeah. What's the time when you were born? 1130. 1130 at night? Of course.  Yeah, typical.  This guy knew it.  That's the real science.  Yeah. Anyways, so the idea of All Gas, No Brakes as a show was to combine the, I guess, road dog ethos of the All Gas, No Brakes book with the presentation and editing style of Quarter Confessions.  Presentation and editing style of quarter confessions.  So it was to take quarter confessions on the road that was pretty much like a simulated hitchhiking experience, but with the editing and, like, punchy effects of quarter confessions, which is, like, I wear a suit, we do the fast zoom-ins, little effects, stuff like that.  It was a – man, those were the best years ever.  It was just so fun.  I mean, imagine you're fresh out of college.  You were just a doorman interviewing people about making out with their cousin and stuff.  And then, boom, this company that you've never even heard of is willing to buy you an RV and give you $45,000 a year, which to me at the time was more money than I could possibly imagine.  So I called my dad.  I was like, Dad, I need you to find me an RV because he's the only guy I know who knows about cars.  Even he doesn't know much about cars.  So he said, all right, I'm on it.  So the RV was $20,000.  And the first event that we were called to cover was the Burning Man Festival.  And that was tough because Burning Man is not too keen on filming.  It's supposed to be a non-commercialized escape you know, escape from the, from reality. I mean, they have a gift economy  set up. It's based upon like mutual participation and, uh, non-exploitation. And so the idea of  making a Burning Man video was tough at first because burn, burners oftentimes, and this is not  all of them, but are pretty well off in general. A lot of them have tech jobs are pretty high up  in Silicon Valley and Burning Man is where they go to take off, you know,  know, to take the edge off and basically become their burner persona.  On the playa, they become reborn.  And they take ketamine and they wear kaleidoscope glasses and steampunk hats and they, you know,  snort MDMA and they run around the sand.  Listen to Tick.  Do you snort MDMA?  That's what I need to do MDMA.  Yes, you can.  I thought it's a pill.  I didn't know.  It's better to take it in a pill or water, but you can snort MDMA. I definitely need to take MDMA. I'm already full of love, but like that, I'd probably go on another level.  Yeah, don't snort it because it'll only last you like 90 minutes.  Let me write that down.  So anyways, we didn't know what to do because we tried to film.  Don't snort. The initial idea for All Gas, No Breaks was to, instead of asking people, what's your  deepest, darkest secret?  what's your deepest, darkest secret? It was what's the craziest trip you've been on?  So the idea was to not satirize drunk people, but satirize people who are fried on acid.  And so we went to Boulder real quick, did a test interview with some lady who talked about seeing ancestral aliens during a peyote retreat. And so it's pretty easy to extract trip reports  from hippies and gutter punks and stuff like that  or oogles.  So we go to Burning Man.  We start asking people like, you know, what's your craziest trip story?  And they didn't have the same type of free-flowing storytelling style that like a on-the-street  trust punk in New Orleans might have where they're like, I don't give a fuck, I'll tell  you whatever.  These people were very bottled up about what they were willing to disclose.  so we went on burning man radio and we did a broadcast and we said hey we're we're doing  we're psychedelic journalists it was me and my friend cl at the time i said we're psychedelic  journalists we're parked on tan and i which is a cross street in black rock city and we said  we have a 1998 catalina coachman sport it's an rv we've set up a podcast studio we're doing a show  about psychedelic voyages yeah so lo and behold two later, we had 10 people lined up at the RV.  Nice.  Willing to talk.  So that vetted people in advance for us.  And so we did a couple interviews and that was that.  Well, what were some of the stories from the trip reports?  There was this lady named Rosma who said that she was known in several circles in Berkeley for being multi-orgasmic and could create multiple repeated climaxes using only her mind by like squinting her eyes and squeezing her eyes together so much that like the pleasure spiral just, you know,  went crazy. I feel like I talked to several people like that at Berkeley.  Yeah. You know what I'm talking about? Not that. Well, yeah, that lady, I think she did. She  manifests herself in many forms. Yeah. Right. So, but still it was on the cruder end. There was one  guy named, uh, Kimbo Slice was his burner name. He talked about taking a shit after taking like,  uh, a quarter of mushrooms and how he was like seeing his childhood and visualizing his past  life you know as the the turds were flowing into the toilet and just talks about the psychedelic  union between pooing and taking taking shrimps so he was very visual with his words yeah so there  was stuff like that i interviewed alex gray which was super cool about his first trip in san francisco  when he was in 1971 shortly after the summer of love,  I got to do some pretty cool interviews, but still it was a semi ambush style. I wouldn't  say that we were doing journalism yet. It was still comedic video work, you know,  was there a narrative that tied it together? It's like really just a trip comedic almost with the  interview. And then I go burning man. And then's on to the next one so i guess that could give a loose structure but it's  just like a punchy and slapstick thing  everything was going good until we interviewed this guy named DJ Soft Baby.  He was wearing a golden leotard with, once again, kaleidoscope glasses,  shirtless, dancing, like, you know, dancing.  And he was eating chowder out of a plastic bowl.  And he was like, this chowder is so fucking good.  He's like, this is the best chowder I've ever had in my life.  And he starts putting the chowder on his face. And he's like, this chowder is so fucking good. He's like, this is the best chowder I've ever had in my life. And he starts putting the chowder on his face.  And he's like, I want the chowder all over me.  Yeah.  And so we just go, hey, man, can you just do a dance for us real quick just for some B-roll?  He does a dance.  We post it on Instagram the next morning.  Doing Things Media CEO calls me, Reed Our pages are down. And he's like, that guy you filmed dancing last night on drugs, putting chowder on his face, that guy's at the top of MIT.  Top of MIT.  I don't understand what that means. He went to MIT saying, you know, my brother's a rocket scientist.  He's like head of NASA or whatever.  Well, I mean, the guy knows people in Boston.  Okay.  You know, not in the Whitey Bulger sense, but in the reverse sense.  Yes.  I have trouble believing that DJ Soft Baby.  Oh, DJ Soft Baby was major.  It could have been Harvard.  It could have been.  But it wasn't UMass.  I don't think there's anybody that's, quote, at the head of MIT who's putting, what was it, all over his face?  Chowder.  Chowder.  Well, then you haven't been the Burning Man yet.  Okay.  I'm not the Burning Man.  But I'm going to have to consult my colleagues at MIT if they know DJ Soft, baby.  It probably was Harvard.  Let's put it on them.  Okay.  The top of Harvard.  So he made some calls, you know, to the tops, to the heads of big tech.  He got all the Doing Things Media pages taken down.  At the time, that was like a vast network of pages.  And we ended up having to take the obviously the video came down and he held the entire network of Instagram pages hostage and so that was a he made us agree to never post that  video again and then somehow got all of our pages reinstated so that was my  first brush was like you know powerful people on drugs and that was probably my  last brush with powerful people on drugs  drugs. So what did you transition into from there? I think after Burning Man, we went to the South,  went to Talladega Race Weekend, went to a Donald Trump Jr. book signing,  went to a Juggalo adjacent fetish mansion in Central Florida called the Sausage Castle.  A Juggalo adjacent sausage. Okay. Can you run that by me again?  A Juggalo adjacent fetish mansion in Central Florida.  Okay.  Fetish mansion in Central Florida.  Juggalo-adjacent.  I mean, every single one of those words I feel like needs a book or something.  Right.  So, by the way, who are the juggalos?  Is this ICP?  ICP fans.  ICP fans, okay.  But I say adjacent because it's not a Juggalo mansion, but there's a lot of Juggalos who kick it at the mansion, and it's Juggalo-friendly. Oh, okay.  Juggalo-friendly.  Yeah, because they get made fun of in a lot of places.  Oh, so it's not...  Okay, got it.  And Juggalos say outrageous shit, you know,  and they embarrass themselves, and they fight a lot.  So they're on the FBI's gang list, which,  The Juggalos.  It would be Violent J and Shaggy 2 Dope.  But there's associated acts like Twizz Did and there's a whole rabbit hole.  Honestly, Tech N9ne is sort of a part of that.  Tech N9ne, I don't know who that is.  Should I know?  He's actually one of the top-selling touring rappers despite having sort of not that many streams.  Tech N9ne is like – it's got a huge cult following in Missouri.  This is like – the J The Juggalos started in Warren, Michigan. We should also say ICP and St. Clown Posse.  So this is a thing.  This is a movement.  Oh, yeah.  If you went to Seattle right now and punched a cop and they booked you in county jail, you may end up running with the Juggalos.  Running with the Juggalos.  They're a presence in Pacific Northwest prison system from what I've heard.  Can you tell a Juggalo from, like, a distance?  Well, they say, whoop, whoop.  So if you see a Juggalo, they'll say that.  Also, like... I'll try to look out for that.  They're kind of...  It's called the Dark Carnivals, the mythology they abide by.  What do they define themselves?  What's the ideology of a Juggalo?  A family, a family.  me. No, I understand, but what's the ideology?  What's the philosophical foundation of the  They're anti-racist.  They like to drink Faygo and also  just like cheap  liquor and stuff like that.  They're into drugs.  A lot of circles, if you pull  out a crack pipe, people will be like, I don't want  to drink with you anymore. If you're at a juggalo  party and someone's smoking Twiz or something,  it's relatively  accepted.  What and someone's smoking Twiz or something, it's relatively accepted. What's Twiz?  Meth.  Meth, right, right.  Lots of tattoos?  Yeah.  The Hatchet Man is the most common one, so it's a psychopathic records logo.  It's a cartoon of a clown wielding a hatchet.  It's actually a pretty sick logo.  I vaguely remember enjoying some of the ICP music.  It's good.  It's pretty good. It funny it's edgy well they get satirized a lot but i got love for the clowns and also so when all got snow breaks  transitioned away from you know rich elite drug parties and into like the south that's when the  fun really started to happen living in your rv in alabama and florida and  stuff is the best why why what is it about people are just so friendly down there and it's warm  year-round and people are non-judgmental it's just great the south gets hated on a lot especially in  the coastal coastal states mississippi and alabama are kind of like the butts of a lot of jokes and  stuff but those are great states i love it new mexico albuquerque all those oh yeah the abqs  it's great bq what's that albuquerque. It's what Jesse Pinkman called it, is the ABQ.  Oh, shit.  The depth of references you bring to the table is intense.  It's okay.  I met a lady in Albuquerque when I was traveling across the United States, and she said, take me with you.  I said, I'm sorry, ma'am, I can't.  Yeah.  But I didn't think bought that lady i think you made the right call i don't know yeah on the road yeah by jack carwack best book i've ever read in my life there's a there's a moment when he meets uh a nice girl  on a bus and they have a love affair it was good on a bus or they no no they went to california  well yeah and there was a love affair on the bus but it wasn't sexual it was just romantic it was  It was in the air.  It was in the air, which there is something in the air on a bus, like a Greyhound, Megabus, that type of situation.  There's certainly something in the air.  There's a romance.  There is, man.  When you travel across.  Because it's like strangers getting together, and you're like feeling each other out.  But you're in it.  You each have a story, because you wouldn't be taking a bus unless you had a story so you're especially if you're traveling cross-country there's something you ever taken the dollar bus from philly to new york the chinatown bus yeah i have that's a great bus the people on that it's not a fucking dollar though  it was a there's some that are five bucks no no no no if you book it way ahead of time  it's like 20 i was like this is a fucking lie calling it one $1. I don't know why I'm swearing. The anger came out.  Hey, swearing's okay sometimes.  Last time I was on the Chinatown bus, there was a rooster walking down the aisle.  Actual rooster?  Yeah.  It was chilling. It was awesome.  There was a nice part of your film with the rooster.  I forgot about that.  Yeah. That felt almost fake.  Yeah.  Did you plant the rooster?  No, the rooster.  There's a place in Ybor City in Tampa where roosters walk around all the time.  And we had a rooster parked there right by the main drag for – did I say we had a rooster parked?  We had the RV parked in Ybor City for a long time, and the rooster laid eggs in the undercarriage.  Nice.  Back to the all-gas, no brakes thing, though.  Yeah, yeah, yeah.  So it was lots it was really fun making it and then we started all gas no brakes in september of 2019 six months later the country shuts down and everything just hits the fan i was actually here in austin when it shut down i was on 6th street i remember the uh  i don't just hang out on 6th street all the time but i was just here you're here come on  i do like 6th street yeah i like east aust better, but I like 6th Street too. So anyways, the NBA shuts down.  Everything's shutting down.  So I went down to the Dirty Six and I asked this doorman.  I was like, are you guys ever going to shut down?  He was like, fuck no, bro.  The Dirty Six never closes.  And I was like, all right, we'll see about that.  Next day, plywood  And then I was like, all right, I thought my career was over when COVID hit.  I was like, what are we going to do?  Nothing's happening anymore.  There's no more parties or Talladega races or Burning Man's to go to.  So I went back to Seattle in the RV and I just spent four months just depressed, living in the RV, trying to figure out what would happen.  But all gas, no brakes went on still. Boy, this was the crazy thing about that period of time is that when COVID hit, I'm sure you remember, everything turned political.  Yeah.  Overnight.  In Seattle, if you went to a house party, you can get canceled because people were like, oh, you're a super spreader.  So if you wanted to socialize, even with a group of four or more, you had to do so with your phone's damn near turned off.  And a lot of people were doing hyper social policing at that time.  Beyond that, in the South and in more conservative places, they were doing the opposite.  They were trying to prove that they could hang out 500 deep with no mask forever.  to make a statement against the establishment.  So you had this polarization that led to more division.  And that's when the anti-vax protests started.  And I went to Sacramento and the passion was unreal.  This is about two months after the COVID lockdowns began.  And that was my first political video was at the Sacramento,  the California State Capitol in Sacramento,  documenting the, they called it the Freedom Rally,  but that's typically like  anti-vax stuff. And, uh, it was real intensity. And that video was my most successful to date  at that time. And so I was like, okay, am I a political reporter now? Am I covering politics?  Like what's going on? What were the interviews that made up that video? What kind of what style of questions were you asking?  What I don't know if you remember, but I was actually scared when the pandemic started.  I thought that this is something that might kill us all based upon what I was consuming.  And so I'd ask people, what do you think about this lockdown?  And I've had people say, you know, I'm immune compromised.  If I get exposed to COVID, I have a 95% fatality rate.  But guess what?  I'd rather be free and dead than alive living in fear.  And I was like, wow.  So it was just stuff along those lines.  You had some San Diego surfers there complaining about the beaches being shut down when such awesome waves were coming.  Yeah, it's interesting how that really brought out the the worst in people oh yeah i'm  not sure why why that is fear maybe paranoia i don't know it really divided people like  along the lines as you mentioned like triple mask yourself or fight for your country. Yeah, right. Exactly.  Why are those the two options?  That is literally what it was.  Yeah, it's wild.  And both groups think they're fighting for the survival of something.  And so that's where you really run into problems when you have two polarized groups who both  think that their cause is for the common good.  mutual understanding is impossible at that juncture and so after three months of almost  every everybody being locked down george floyd happens and i remember i saw the third precinct  burning on my phone in minneapolis and uh everyone says andrew you have to go cover this.  And I'm somebody, like I said, you know,  police violence has been close to my heart since I was a kid.  And my first thought is, I can't do that.  I'm a comedic reporter.  I can't go to Minneapolis and cover this.  It'll be the end of my career.  And I had a friend named Lacey who I went to college with.  And she told me, she was like, bro, this is your chance for you to do something serious.  You can actually create a meaningful piece of reporting like you always wanted to before quarter confessions.  And you can turn All Gas No Brakes into a news source.  So I called Reed, who is the CEO of the company that owned All Gas No Brakes.  And I was like, look, man, I want to go to Minneapolis.  I was in Orlando at the time.  I was actually at the Sausage Castle.  And he said –  Sorry, the Sausage Castle?  Yeah, the Juggalo Mansion.  Oh, right.  That's called the Sausage Castle.  So I'm watching Minneapolis unfold on Lake Street where it was burning.  And I got to the Orlando airport, and I booked a flight without – I booked it on my own card.  I didn't consult my boss or anything.  And I was sitting in my seat on the flight and he straight up told me, he's like,  if you fuck this up and this destroys the brand, we're getting a different host. This, if you mess this up and you turn our, our, our show away from a party show about drinking and drugs and all that stuff,  and you make this a social justice show, you're done.  But I was like, I just turned my phone off.  I got to the Minneapolis airport on the second night of the riots.  And when I got to the airport, there was National Guardsmen in the airport,  and it was like a call of duty mission.  The one in the airport.  And on the speaker, they say, if you're arriving here right now, you are not permitted to go anywhere outside of the airport.  National Guardsmen will escort you to your Uber or to your car.  They're going to take a picture of your ID.  They're going to figure out where you're going.  You are not permitted to go outside tonight.  And so Lacey picks me up.  There's two people in the back, two of her homegirls wearing, like, sheisty masks.  And there's two people in the back, two of her homegirls wearing like sheisty masks. And I'm like, what are we doing?  Where are we going?  And she goes, we're going to go film the riot.  We're going to Lake Street.  And so we drive down there.  Kmart is burning.  Target is burning.  Everything is on fire.  She has the Sony A7.  She gives me a microphone and she's like, go talk to that guy. And that was the guy with a Molotov cocktail in his hand who had just burned Kmart down.  And so I go, what should I ask him?  She goes, what's on your mind?  So I walk up to him, and I'm like, what's on your mind?  He said something like, everything that was happening here was supposed to happen.  This is how we feel.  Is it right?  No.  Is this going to benefit the community? No. But this is how we feel. This is how we feel.  That's pretty powerful.  Yeah.  Through a lot of the...  the documenting that you do, this is how we feel is like screaming through that.  Yeah.  And I noticed that aside from a group called Unicorn Riot,  there was no one else actually interviewing the protesters.  The local news was on the bridge 15, not 15, but five blocks away,  filming just the scene itself, just the fire.  But I saw some crazy things off camera too.  I saw, so there was kind of two groups  there. There was like the anarchists, more mobilized protesters. And then there was just  mostly African-American community members who were just pissed, who had nothing to do with  the organized resistance. And they were all kind of joining forces to riot. And there was this  anarchist kid who ran up to White castle with like a molotov cocktail  and he was about he's about to throw it at white castle and this black dude ran up to him and  grabbed his arm and he's like ah we fuck with white castle and i was like what and so you see  if you go on lake street every business is burned yeah white castle remains i also saw these dudes  rip this atm out of a bank and hit it with sledgehammers.  They were a group of friends hitting it with sledgehammers, right?  They're hitting it with sledgehammers.  Boom.  All of a sudden, money starts spraying out of the ATM.  Like, I've never seen some shit like this, like pouring out of it.  And then this group of friends who were just united in getting it open start fighting each other for the money as it's flying.  out of it. And so there was just, it was like a, like Joker from the Batman's army type,  type vibes. But I got shot in the ass by the national guard. It was no good.  Like a what? A rubber bullet?  Yeah. Yeah. Not, not shot.  What did that feel like?  Honestly, it hurt.  I'm not sure what I was expecting as an answer to that question.  Yeah.  I liked it. It was good. Yeah. And then after that, I posted the video, and it was very well received.  And that was the pivotal point where I realized that everything was going to change.  I mean, there was still kind of a comedic element to the way you do conversations, to the way you edit.  So did you see yourself as potentially like a Jon Stewart type of character?  At first.  But, you know, I just think human beings are just funny in general.  Yeah, the absurdity of it.  The cool thing about Jon Stewart is  I generally like to say that anybody who works for  corporate media, whether it be Comedy Central  or anything owned by Time Warner,  Fox, MSNBC,  they can't say what they want.  Because in order to climb up in those organizations,  you have to appease the narrative of the company  that you're working for to rise  has so much clout in the media world that I'm pretty sure he can say whatever he wants.  Like, I actually don't think that Jon Stewart is controlled by anybody.  I really don't.  I think that he can go on the show and talk about whatever.  I do think that certain people have broken the brains of,  COVID broke the brains of a lot of really great people I admire.  Trump broke the brains of a lot of people I admire,  like to where Trump  derangement syndrome became a thing.  You can't see the world quite as  clearly because of it. And I think  John Stewart is  quite a genius at  stepping away, even though the world needed  him in that time.  Stepping away during that moment  of Trump and coming back now, sort  of being able to reflect being sort of that elder statesman.  My favorite Jon Stewart moment that illustrates that perfectly is whenever he went on the  Colbert show and he was just joking around with Stephen Colbert, who I think is a full  blown propagandist about uh the wuhan lab leak theory he was just goofing around he was like  it's called the coronavirus lab and they had it before and now what do we have and it was like  you could see in steven colbert that he was like gun to his head type shit where he's like john  john stop joking about that yeah and that made me realize like, oh, everything that Jon Stewart did, especially for the 9-11 first responders, he's a true American and not in the sense of like the different political parties want you to believe is an American.  Not a do your part and social distance American, not a, you know, wave your Trump flag in the back of your pickup truck American, just a guy who genuinely stands up for what's right.  There is a degree to which you can be in those positions easily captured by groupthink, though,  even when you're not controlled by bosses and money and all that kind of stuff.  I think Jon Stewart has been mostly resistant, but it's hard, his position.  is difficult. I think he's done the best job, though.  If someone in that obviously  Democrat-connected  corporate media economy, he seems  to be the freest talker.  Yeah. So this is when you first  became famous. I'm not even  sure what fame means. I mean,  I just see myself as me. When did you get  the shades? Oh, that was on tour.  That was... That's a whole...  The shades... That's a dark time.  But this – I didn't make –  This is a meme, really.  I don't even know if that's a symbol.  I didn't make journalism to become famous.  I made it to give people a platform to share their stories.  It just so happens that people liked it enough to where I became sort of famous.  But if I could go back and not be the on-camera guy  and just platform the stories, I would.  But the reality is people need a face to attach to stuff they like,  and so that's just how it is.  But, yeah, I would say right around Minneapolis protests,  Portland protests, Proud Boys rally time,  when I was really in there is when I started to be acclaimed  as more than just like an ambush meme.  lord did that have effect on you the fame not at that point not at that point so like you were  still able to have a lightness to you well the country was basically closed yeah so it wasn't  like there was a street to walk down where people were like there's that guy so getting famous  famous during covid made it so when the country reopened it was as if like i did my life really  changed because i was like, oh, all  these fans I made during COVID are like seeing me out at the bar.  This is cool.  At first, fame is the best thing ever because you can go anywhere in the country and these  spaces that you normally feel a bit insecure in, like a local dive bar, a cool restaurant,  a coffee shop where you just be another guy.  All of a sudden, they're like, oh, my God, I'm a big fan.  They give you like free stuff you get this sense of acceptance that you never would have got before so but there's also the dark side well it's all love man i i love i mean i just to speak to the first part you're saying  is there's so much love that people have and it's amazing i'm sure you know what it's like that's  It's beautiful.  The only downside of fame, really, is that you can't really be anonymous again.  And you have to seek out more strange environments to be anonymous in.  Like right now, I live in the desert, basically.  And I want to live in the middle of nowhere in the Mojave Desert.  Not because I'm scared of people, but because I just want to be like curious me again.  People don't know and I can ask questions to people that I'm interested in without them going,  I remember, I see you here, I see you there. That's the main thing.  That's what I loved about hitchhiking.  Yeah, just to have anonymity.  Yeah, it's the best.  But both are great.  Complaining about fame is just the lamest shit.  Yeah, we should go to furry conventions that you covered.  Wear an outfit.  I love furries.  I should do that. Yeah, we should go together. I go all the time. We should go together. What's your favorite? No, I have not.  I think you might like it more than you think.  Listen, maybe I'm just afraid to face who I really am.  Yeah, your first owner of the True Lex will come out when you're in a $3,600 lizard suit.  Everything is possible.  Lizard?  Is that what they go with?  Well, Scaly's.  are the lizard furries.  Yeah.  And there's a big division in the community where they think scalies are kind of douchebag, you know,  because the scaly suits are more expensive.  They're about $7,000, whereas a fur suit is $3,600.  And they're also taller.  Yeah.  So when the scalies pull up to the fur fest, it's like, ah, fuck the reptiles.  Fuck the reptiles.  I can get behind that. I'm more like a teddy bear type of guy. Yeah. I think bears. What's, maybe squirrels.  I don't know.  Oh, squirrels are so cool.  Giant squirrels, yeah. I want to put a GoPro on one and just see what the hell they do.  You were talking about that conversation with the guy at the head of Doing Things Media.  How did that end up?  Well, I mean, I want to clear up a few things.  Reid, the CEO of DoingThings, I actually think he's a good guy. I think that he was just trying to run a business.  He saw what was working for his brand,  which is very college-centric, very festival-centric,  and he was right to think that journalism,  and especially coverage of sensitive topics like COVID  or police brutality would definitely not work on merch.  You're not gonna sell a picture of me  interviewing someone at a riot like you would  It doesn't work the same.  So it was a lot harder to monetize, not just because of YouTube censorship, but also just because of the sensitive nature of the content.  So Reed was looking out for himself as a businessman.  There was a different partner.  I'm not going to say his name.  That was more connected in Hollywood.  I think he's responsible for the collapse of the show.  What was the collapse like?  What was so right as the country's reopening, I get a DM from Eric Wareheim of Tim and Eric.  And I'm covering something called the UFO Mega Conference in Laughlin, Nevada, which  is a beautiful river town.  And, you know, he DMs me.  He says, let's make a show.  And I'm like, oh, shit, is this real?  You know, I grew up such a big fan of Nathan For  You and the Eric Andre show. And those are produced by their company. Absolutely. So I was like, hell  yeah, let's do it. Three days later, I get a call that says Jonah Hill wants to hop on board.  And I can't believe this, you know, I'm still in the RV and I'm in Laughlin, Nevada. So I'm like,  Jonah Hill, super bad. Are you shitting me right now? So I was excited. And Moneyball, Jonah Hill's a great actor.  Oh, he's great.  He's great all around.  Yeah.  Doesn't get the credit he deserves.  I mean, he's got the credit by now, but still the credit.  there's more. So basically just within a week, I assembled this super team of Tim and Eric.  Super bad team?  Yeah, pretty much of Tim and Eric.  Sorry. I'm so sorry.  No, that was good. And Jonah Hill. And yeah, we just pitched it around. Every single TV  network rejected it. I don't know why. And they mainly did that because I was in this  weird situation where I had signed a contract with doing things media that I didn't realize was called a three 60 deal.  That's what they use in like the rap world basically means that I can't do  anything outside of them without them getting a hundred percent of the money.  So if I was to go work at Sbarro or Quiznos while I was working for all gas,  no breaks,  they would get my 500 bucks a week from the sandwich spot.  I was unable to earn any outside income.  I didn't read the fine print because I was 21.  And like I told you, 45K a year RV sounds sick.  And basically, the TV networks were like, why would we buy a show if the digital brand  is going to be running it?  At the same time, because they didn't want to stop doing all gas, no brakes to make a TV show.  They wanted all gas, no brakes to continue as a web show while all gas, no brakes as a future TV show at Showtime or Hulu or somewhere like that was also concurrently running, which is impossible for one man to do.  And so every TV network said, OK, we're not doing that.  We want an exclusive rights contract with this guy.  Next.  Oh, yeah, this is crazy to think about because it all happened so fast.  So Jonah Hill says A24 Films wants to do a movie instead of a show, and they're going to let you keep the digital brand running. So this meant that I could keep doing my Instagram stuff with doing things media slash all gas, no brakes while making an A24 movie with Jonah Hill and Tim and Eric.  So it was just like, I was excited.  It sounded perfect.  So they said, okay, what do you want to make a movie about?  And I told them, okay, here's what's going to happen in 2020.  If Trump wins, there's going to be riots across the country.  The major cities are going to burn down.  if Trump loses, the militias and his loyal supporters are going to try to have a coup in D.C.  That's what I said.  And I said, so I'm going to follow the lead up to whoever wins the election,  and I'm going to document what happens after.  So they said, okay.  And so I was to begin filming in late October, you know, during the campaign trail,  maybe mid-October up until November and then in the following months to see what would happen.  This meant that I couldn't film anything for All Gas, No Breaks, the digital show, because I had to dedicate 100% of my time to making this perfect movie.  Still, one of the partners at Doing Things Media was demanding that I not only produce the movie, but also more content for the show.  And I told them, there's only so many hours in a day, man, that's going to be impossible.  And I said, if you want it to be possible, I can make it work, but I want to have half of the monetization from the show.  50% profit split, which I thought is fair.  If you want me to do double work when I was getting almost nothing before, split me in on the profits.  they fired us immediately.  Me and my two childhood friends who I hired to work on the show with me were all out of a job.  As we were filming for the now HBO project, we got our fire notices.  The guts on that person, because you should be owning probably close to 100% of it.  I think so, too.  But they didn't see it that way because they figured we made the initial investment.  We discovered him is how they looked at it. I think so too, but they didn't see it that way because they figured we made the initial investment. We discovered him is how they looked at it. So it wasn't Reed, but it was the other partner who wasn't Reed who said, we have tons of verbatim. He said this, we have, I have  tons of connections in the comedy world. We can replace Andrew overnight. I'm not sure why he made  that miscalculation. I wish he would have thought about it twice. I wish it didn't have to end like that, but it did. Why do people do that?  Like what's the benefit of acting like that? I think you can part amicably without the drama.  I think all betrayal and anything like that is motivated by self-interest, whether that be  economic success, social stability, whatever it is.  They figured that because I was being such a burden and asking for the profit, that they could just release me and find someone equally talented and not split them in so they can  make more money.  Oh, I see.  Well, that's a stupid way to think.  People think like that, man.  People who are – the word I use is like sidekick syndrome.  Like when people are kind of a part of the production but they're not integral, they start thinking that the front man doesn't matter or something and that the brains of the operation are actually the people on the periphery.  And so they start to believe that they can just shift things around and the audience won't care.  that they can just shift things around and the audience won't care.  Not realizing that I was actually the one who created the show and that the lore of the show is connected to my rise outside of their jurisdiction,  if that makes sense.  Like the people who watch All Gas, No Brakes watched Quarter Confessions  and read the book.  And so, you know, well, this happens also not just financially,  but just with people that are part of a team,  but they don't really contribute creatively to the team, and they force their opinion or pressure,  whether it comes from editors or all that kind of stuff, or from sponsors.  There's pressure they create when the creator alone should be celebrated and have all the power because they're the ones that are creating the thing.  In a way, I have sympathy because I can't relate to that because I've always been the front man of my own projects by design.  So I'm not sure what it's like to be someone's owner from a content perspective.  I don't understand the challenges they face.  Maybe there was something that I didn't understand. I don't understand the challenges they face. Maybe there was something that I didn't understand.  I don't know.  True.  Well, oftentimes if you own a thing like this, like this company,  you do think about brand.  Right.  And then maybe you have a big picture idea of what brand means,  and that can be at tension with the creative project, right?  Yeah.  the creative project, right?  Yeah.  But ultimately, freedom for the creators  is the best kind of brand.  I remember all three of us who worked on All Gas No Brakes  got fired at the same time.  And we were in the RV that  Tim and Eric's company bought for us,  which was a bigger RV, in the  parking lot of a Walmart  in South Philly.  And the propane had just ran out and it was 15 degrees outside.  So like the RV was getting really cold, really fast.  And I just looked at my phone and it was like, you're fired.  And I was just like, God help me.  I've had a couple moments like that.  and God does help me.  And they were always in the parking lot of Walmart, right?  Well, yeah.  Although –  I know that Walmart, by the way.  The one in South Philly is great.  Yeah, it's great.  But technically now you can't park an RV there.  Well, you're not a man who follows the rules, if you know what I'm saying.  Well, the thing is those Walmart, Cracker Barrel, and Big Five are supposed to technically all let RV campers park overnight. But if there's like a crime problem in the city where they're at,  they can lobby, individual Walmarts can lobby with the corporate to take that away. So like  all the Portland Walmarts, you can't sleep there anymore. Any city with like significant homelessness  and like petty property crime, the Walmarts are a no-go. Fascinating. So that was a low point.  was a low point yeah and but from there from the ashes the phoenix rose over time yeah channel 5 was born channel 5 was born in the march of 2021 after uh we finished filming for the hbo project  oh really so you went all in on the hbo project yeah i mean we filmed the hbo project from  november 2020 up until uh april 2021 damn  near we were just like you know picking up the pieces going back for individual interviews  stuff like that  So let's go to that project.  It turned out to be a movie called This Place Rules.  It's supposed to be called America Shits Itself.  Yeah.  Maybe you can tell the story of the film.  You have, what's his name?  I wrote this down.  Joker Gang and Gum Gang.  Is that correct?  Yeah, the opening scene.  The opening scene of two characters just talking shit and then getting into a fight. And that, I think, was really brilliant how you presented that as almost like a microcosm  of, like, the division  between the  extremes of the left and the extremes of the right.  That's exactly what it was. I'm glad you picked up on it.  Yeah. And then, what I  really liked is that the Joker, again,  Joker gang  was kind of, a little  bit of a spoiler alert, I apologize,  but at the end of the film,  it was a kind of a voice of wisdom.  Yeah.  He seems the most sane.  He was the voice of wisdom.  He, like, cut through it.  Yeah.  I also just realized that a lot of people are going to stream the movie after watching this podcast, which is cool.  Yeah.  Where do they stream it?  On HBO Max, right?  Yeah, HBO Max.  promote the movie. It's such a pain in the ass, man.  I wish we could all just pay on it on YouTube  or something. Yeah. And HBO gets  the profits or whatever, but like, it's such  a... I have to subscribe for  every single thing. But yes, if you want to watch it,  it's really... I recommend it extremely highly.  Sign up to HBO, whatever the hell.  On the positive note, HBO  is great to work with. Like,  they're the most professional, respectful company I've ever worked with, pretty much. Yeah, HBO has created some of the greatest TV ever. But even in the background, they get shit done.  There's no wait time.  They have some of the best heavy hitters on their team for trailers, for posters.  All the promotional apparatus they have is super solid.  Did you get good notes from people there?  A little bit, man.  It's a truly original documentary, meaning I just haven't seen anything like it.  It's even, like...  So, like, there's a humor and a lightness at the right kinds of moments.  Mm-hmm.  Like I said, there's, like, a rooster in here.  That's, like, okay, that's, like, a non-sequitur, like, thing as part  and how once, like, January 6th happens, like, everybody, like, goes on to the next thing.  Yeah.  It's like, what happened to us?  It was almost like a delirium that everybody was participating in, some weird, just like, well, like people say, mind virus.  Like, all of a sudden, we just got captured.  Yeah.  And people were just, like, yelling at each other, doing the most ridiculous shit.  And, I mean, really, January 6th, the way you present it especially, just reveals the circus of it all.  I mean, it really broke the fourth wall, or that's how I would describe it.  Because if you were at January 6th and the lead-up, it felt like it was the beginning to a series of similar riots.  But it just popped off so much that that was it.  You haven't seen anything like it since.  It was supposed to be a second one on January 20th. It was the actual inauguration. That never happened. It was a crazy time to be alive and around, and especially the relationship that I developed with Enrique Tarrio,  who was the former chairman of the Proud Boys. He's now facing, you know, 23 years in prison.  It took a trip because I went to his house in Miami maybe two weeks after January 6th, and  talking to him, it seemed like he didn't think anything was going to happen.  He was just like, yeah, man, that was crazy.  I'm glad I wasn't there.  They're dumb for doing that.  He even told me he doesn't think the election was stolen, which is just a mindfuck.  It's like, why did you get everyone so hyped up?  It's just weird to think about how so many people's lives are drastically altered forever  because of that just bizarre moment in time that we'll always live on.  Yeah. What did you, QAnon is part of that story. What'd you learn about QAnon from that?  Just an all encompassing worldview. That family that I talked to, I call them the QAnon family,  but it's called the Spencer family. You know, they were non-political up until the Stop the Steal movement began in September of 2020.  And within four months, their entire life revolved around the mythology and lore of Q.  And I've never seen in my life a psyop just devour people's minds in such an intense way in such a rapid period of time.  And I love how the kids in the movie are also the voices of wisdom. The Spencer family, it's the kid who goes through the full journey of believing that whatever, Hillary Clinton is a lizard, and just believing all the worst versions of the conspiracy theories, and then...  kind of waking up was like, what was the point?  Yeah, it was heartbreaking to see his disappointment in his dad for even, you know, following QAnon so militantly.  Because he was like, I felt like they let my dad down.  I felt like they let our family down.  You know, because January 6th was supposed to be the day, according to QAnon, that the storm happens  and that the military is supposed to mobilize and arrest the members of the deep state, Clinton, Soros, all that.  Trump was supposed to go into a helicopter, you know what I mean, and take control of the country back from the swamp.  And it didn't happen.  In fact, the next day he was like almost denouncing it.  Now he doesn't, but then he did.  And it was really – I think it hurt people's pride a lot.  My friend Forgiato Blow, he's a Trump rapper. He describes it that way.  He said a lot of people's pride got hurt by January 6th.  Trump rapper.  Oh, yeah, dude.  Honestly, there's some pretty dope Trump rap out there.  I'm serious.  MAGA rap.  Yeah, like you would think like, oh, yeah, MAGA, there's no rappers there.  But there's rappers, and they do a pretty good job.  Oh, they have some political depth to them?  Yeah.  Wow.  I mean, is there something more you could say about how QAnon works?  Like, who's behind it?  What's your sense of who's behind the whole thing?  You know, I don't want this to sound rude or anything.  I just don't care about QAnon.  You know what I mean?  I just don't care about QAnon.  You know what I mean?  I've put so much thought into it, and I just can't seem to care about it.  Was it almost a disappointment?  Because to me it was like a thing that just captured a very large number of people's minds,  and then it just kind of faded.  I guess that's why.  It just seems like uh it's gone and the ideas of q anon have just bled into mainstream standard conservative thinking but there has to be a kind of retrospective like that's a problem i have with covid  you know a lot of stuff happened everybody freaked out there's a lot of big drama around it and now  everyone's like okay forgot yeah just like Yeah. What are the lessons learned? Has anyone  learned any lessons? Yeah.  Exactly. What I'm saying is  I don't want QAnon adherents to see this  and think I don't care about them.  But as far as who is behind  it, the damage is done.  What are the mechanisms that made it work?  Have you kind of thought about that?  I kind of think that  these viral ideas can be driven by, and your film kind of shows this,  by just a handful of people.  And they're not malevolent.  They just want the clout.  and there's something sexy, there's something really sticky about conspiracy theories,  especially extreme ones.  Some of them can have this momentum that captures the minds of a lot of people,  and you just go with it.  When I hear some conspiracy theories, there's something, like a small part of me,  that's kind of like, yeah, excited.  It's possible that Q anon is a psyop  to distract people away from actually uncovering what the deep state is and who is truly  running things behind the scenes because the deep state is just the one percent it's that you take  you get people so close to any type of class consciousness, and then you totally divert everything into  like lizard humans who live on the moon and that Hillary Clinton is eating babies on camera  and QAnon did just that.  They want to convince you that one, there's no conservative deep state, which is even  more hilarious, that Trump isn't connected to a huge, rich corporate apparatus of propagandists  and two, that the democratic establishment is the only deep state.  and that some middle-of-the-road conservatives,  that there's no grifters or manipulators  outside of that three-headed snake, you know?  There's grifters everywhere.  Everywhere.  Everyone wants to make money, dude.  This is the world that we're in.  It's in collapse.  Everybody wants to make money,  and engagement is the rule of law.  So anything, that's why these news organizations  follow retention incentives.  They want to make money by selling ads, so they try to create fear and constant division to enrich corporate media establishment.  And you have people who are almost realizing, hey, it seems like Fox and CNN might be owned by the same people and are tactically using these machines to keep us divided perfectly 50-50 to ensure that the power structure never gets disrupted.  And then you get these people.  You know who's going to save us?  Donald Trump.  That's the guy.  How is that the guy?  It's not the guy.  I don't have TDS.  I'm not an orange man basher who thinks about the guy all the time, but I don't think he's the guy.  you were shirtless  lifting weights  while whiskey or some alcohol  was poured into your mouth by Alex Jones  in this movie and then you did the same to him  that's true  that sounds like an interrogation  so Alex was a  was a part of this film  he was like throughout the narrative  and you had a great interview with him  what did you learn about part of this film. He was like throughout the narrative and yet he had a great interview with him.  What did you learn about interacting with Alex  Jones for making this film? For one,  he's the exact same off  camera as he is on camera. Yeah. It's not  an act. He told me that all  real Americans die before 58.  He mentioned Sean Connery  and a few others.  How old is he?  Getting up there.  I think early 50s.  I just found it fascinating  how nice his studio is.  The guy's got an MSNBC level setup.  I actually had a great time with him.  It's bizarre because  And having him in that movie created so many problems for me.  And when I interviewed him, you know, I didn't necessarily portray him in the best light.  You know, we joked around a bit, but it wasn't an Alex Jones hit piece necessarily.  But I like to think that I was a bit critical of him in the film, especially the ways that he antagonized his supporters to storm the Capitol or to follow that trajectory.  He told me when I met with him, he was like, I know you think  that having me in this movie is a good idea, but, um, you're going to have some serious backlash  because of that. At the time I was like, man, it's fine. You know, it's all good. We're just  hanging out, drinking whiskey, doing bench presses, drinking Jameson. It's all good.  It was, uh, first of all, I had to campaign to get him in the film because the studios were like, we don't,  there was a bizarre time around like,  I think it was 2018 where D platforming was the big thing that people were  encouraging.  It said,  giving a platform to problematic ideologies will in turn expand their reach.  And so even extending your platform to someone who's problematic is,  is helping them, a.k.a. destroying humanity, whatever it was.  So that was the whole thing.  And when I did this media training that was mandated by HBO,  it was all training and how to defend from that exact question.  They said, when we put you on NPR and we put you on CNN,  they're going to ask you about platforming problematic ideologies.  And you're going to have to say stuff like sunlight is the best disinfectant. I believe that  extremism only goes away when you shine a light on it because leaving it in the dark will only  allow it to grow. They gave me like 15 pointers. I didn't use any of those pointers because I'm not  the kind of person who wants to be media trained. I like to speak freely.  But in the promotional run for the film, you know, when I went on CNN, this was a crazy experience.  So I went on CNN, and thankfully, my friend was with me.  And so I'm on CNN.  By the way, your friend is chilling in sunglasses laying in the cockpit.  That's Larry's suit.  chilling in sunglasses laying in the car.  That's Larry.  It's like the,  it's a mix of like the dude from the big Lebowski and,  uh,  uh, the Brad Pitt role in,  uh,  True Romance?  Yeah.  You know that reference?  No, but I mean, I'm sure it describes Larry Silver.  He kind of looks like Jack Kerouac.  Yeah.  So HBO had a press tour set up for me.  And the main ones were CNN and NPR.  And so they said, you're going to go on CNN on the Don Lemon morning show.  And he's going to ask you about your life, what led up to the movie, what we can expect.  So I get in the studio. It's about seven o'clock in the morning in New York at his show the night before at Times Square. So I'm like groggy-eyed,  whatever. They put the lab on me. Boom, I'm live on CNN, Sunday morning. And he goes,  how would you describe Enrique Tarrio's mental state in the lead up to the Capitol insurrection? And I'm looking around. I'm like, is this guy serious? Like, am I sandwiched in the January 6th hit piece right now?  I thought it was about me.  And so I told him it's not about Enrique Tarrio.  It's about how companies like Fox, MSNBC, and even your station, CNN, use the 24-hour news cycle to enrage people to generate ad revenue and pit Americans against each other during times like that.  And he said, there's nothing fake about CNN.  And I said, there's nothing fake about CNN. And I said, I didn't say you were fake news.  I'm not saying you're lying, but you're directly antagonizing and stirring people up against half the country because you need money to support a dying platform.  You said that.  Pretty much.  Nice.  Great.  Right.  You know, I was so – my mom was watching it.  She was texting me.  She was like, what are you doing?  And I was like, I don't know.  And so he goes, why did you extend the platform to Alex Jones?  And I go, I don't know.  I just wanted to drink some Jameson and lift some weights with him.  You know, I'm just – at this point, I don't support that kind of media.  I don't support CNN.  So, you I didn't give them much information about Alex, but it was very awkward. They never posted the segment online. When I got off of that interview, I had a handler that A24 assigned to me.  So I had someone with me, and you could tell she was flustered.  Like she was furious about what I just did.  And so she goes, I just got an email from Time Warner C-Suite.  And I go, what's Time Warner C-Suite?  She says, I don't know if you know this, but the same people who own CNN own HBO.  And it's Time Warner.  And so they canceled my press tour.  So my press tour was finished.  You know, all the late night shows that I was supposed to go on, I was supposed to go on like the late night shows.  And that was off the table because they were worried that I was like a loose cannon, I think.  and then the only remaining appearance I had left was NPR in Boston,  and that was supposed to be a premiere.  So it wasn't supposed to be an interrogation.  It wasn't supposed to be anything like that.  It was supposed to be a premiere in front of a live audience where they watched a film,  and I show up after for a Q&A.  So I'm like, all right, whatever.  It's kind of weird.  I only have this one press opportunity left.  I kind of felt bad that I ruined the entire press tour by confronting Don Lemon. But at this point, I wanted to just do this final one, especially because it was a viewing.  And I was like, cool. I sat in the audience. I watched people laugh through the film. It was awesome. So I go backstage and there's an NPR journalist waiting for me. And nothing  against people who wear masks, but she had two N95s on. And two N95s is over the line.  So I go, hey, great to meet you.  She doesn't shake my hand and I go, why not?  And she goes, you've been around some people who I don't want their germs.  Yeah.  Oh, and I'm like, OK, OK, this is weird.  I thought this is a sort of like fun premiere for my movie.  We sit down. The first thing she asks me is, how do you think the Sandy Hook families would feel about you platforming one of the most despicable Americans in history, Alex Jones?  In front of a live audience, NPR never published this. The only recordings of it are by a fan named Rob in Boston who put it on YouTube, vertical phone footage.  And I literally am like, well, the Sandy Hook family's lawyer, Mark Bankston,  who represented them in court in Connecticut, told me specifically that Leonard Posner,  the father of Noah Posner, who died at Sandy Hook, was a huge fan of the film.  And so I said that to her and that kind of just like silenced that conversation.  But the rest of the whole conversation was just about exploitation.  And why are you platforming mentally ill people and giving a platform to conspiracies like QAnon?  Don't you feel like you're a part of their spread?  Someone call you a misinformation reporter.  All this crazy stuff.  And yeah, next day hit the fan.  Fuck all those people.  That film, just in case you don't get a chance to see it and you should,  you were critical of Alex Jones in the most artful way.  Like it was the correct way to be critical.  It showed him to be more interested in the grift of it.  Yeah. be more interested in the grift of it. And you didn't do it in a, like, pointing fingers and, like, saying,  in the kind of NPR way that you just mentioned.  It's more like a human way.  Like, this is tragedies happen all over the world,  and there's grifters that roll in and then take advantage of it in interesting ways.  And then human beings get swept up on either side of it,  and it's revealing the humor, the absurdity of it all. And then human beings get swept up on either side of it. And it's revealing the humor,  the absurdity of it all.  And it was done masterfully.  It was done,  like for people who criticize it for platforming Alice Jones or whatever.  Yeah.  The film,  from a political perspective,  is probably leans very much left.  Yeah.  Like heavily left.  But does it without,  you know,  that exhausting energy of like judging,  right.  Just this kind of,  uh,  you know,  yeah.  Two,  two masks kind of judging.  Yeah.  And it was just,  uh,  when all that was happening,  when I was under fire from the mainstream press for platforming,  Alex Jones,  I thought back to what he said to me.  And it doesn't mean I agree with everything he says,  but he told me you're going to be in trouble with these people if you put me in your video.  And it wasn't too bad a trouble,  but definitely I do think sometimes what the film would have been like without him.  And I think that it was worth it because his scene is so funny to me,  and it brings me back to a different time in my life,  and I'm happy that that scene's out there. I think it was really well done.  Thanks, man. The layering of it all, the entertainment, plus sort of not considering from his perspective the consequences of rallying people up in this way, that it's not just – I mean, you really highlight this in the interview.  He keeps saying it's InfoWars, but then there's always kind of a sense that Infowars can turn to actual like civil war.  And yeah, but maybe not.  Maybe it's all just a circus like we play for each other.  If you look at the speech he did on January 5th, it was said he said tomorrow, you know, millions of patriotic Americans will take our country back.  Yeah.  So he eggs people on.  And then when it gets hot, he steps away.  Yeah  But like you said  The thing he told you  He turned out to be right  Oh yeah  And the frogs are becoming gay  They've always been gay  Well  Saying frogs are straight is even crazier  I've read stories where you kiss one  And it becomes a prince  Yeah that shit's true  100%  You think Alex believes what he says  In terms of the  Everything he says on InfoWars?  How much of it is real?  He's right about big tech censorship.  I think if he's right about anything, it would probably be the heads of big tech colluding together across company lines to deplatform certain people.  He's right about that.  I think most of the things that he says follow the question everything narrative and then everything is kind of like a  conspiracy or like a plot or a false flag.  I think that he's built up a following for so long that wants him to do that, you know,  so I think he'll question things that he probably thinks are relatively straightforward  because that's the shtick of the show.  I mean, the Info War is fighting misinformation.  and people want to see him be that guy.  To a certain extent, if you're a creator who supports your family,  you do follow economic incentives, and people want you to be the character,  and so you're going to naturally gravitate toward being it.  Do you feel that pressure yourself?  I did years ago.  Not anymore.  I feel like now I can speak freely and really say what I want to say in my new life.  But when I was younger, yeah, I felt like I had to be this sort of awkward,  sort of amicable, aloof guy who just didn't think anything about anything  and just was here to listen.  But now I feel more confident adding some narrative and voiceover  and things like that.  So for some people, especially who publish on YouTube, the YouTube algorithm,  they can become a slave to the YouTube algorithm.  Yeah, I mean, for sure,, the YouTube algorithm that can become a slave to the YouTube algorithm. Yeah. I mean,  for sure.  Cause,  and I,  I definitely feel that sometimes I know what works for me,  but I,  I like to think that my audience appreciates when I tried new things.  So I'm not totally enslaved to it.  I mean,  yeah,  I try not to pay attention to views or any of that.  Well,  you get some high  anything I create. So you took it to that level?  Yeah, just because it's a drug,  man. And I'm also a number guy,  meaning, like, you give me, like,  if I do 30 push-ups today,  tomorrow I'm going to try to do 35, just, like,  enjoying the number go up.  That's why I like video games, like,  RPGs, like, where you're, like,  improving your skill tree, you're, like,  getting an extra point. And there's some aspect of YouTube and other platforms, anything, any other platform, you're like, ooh, I got more today than I got yesterday.  That's really, really dangerous to me because it can influence how much I enjoy a thing.  Like if nobody gives a shit about it based on the numbers, you're like, oh, maybe that wasn't such a great experience.  I thought it was a great experience, but maybe it wasn't.  Yeah, honestly, I do actually feel that way sometimes.  Like I'll put out something that I care about a lot, but if it doesn't get as many views, I'm like, all right, it must have not been as good as my high review videos or whatever.  Yeah, that's just like not true, though.  Yeah.  Yeah.  And it might mean, like, on YouTube that your thumbnail sucks or something like this or whatever.  Whatever, however the algorithm works.  But, I mean, that's the thing I'm battling against to make sure I ignore all of that.  It's actually something Joe Rogan has been extremely good at.  He gives zero shits.  Yeah.  I think it's easier to do when you're really successful.  Well, he was doing that when he wasn't successful.  Really?  But anything.  He just follows, like, the stuff he enjoys doing and legitimately enjoys it.  He happens to be really good at it, but he gets good because he's doing the things he really enjoys and, like, full-on passionate about.  And that's why he'll have, like, ridiculous guests and just shit he enjoys doing.  Yeah, it's pretty cool.  Maybe I'll guests and just yeah and just like this shit he enjoys doing yeah it's pretty cool maybe i'll one day try to do that for now i'm too attached to like the gratification of getting a million views  in a day and stuff like that i'm not gonna lie to you and say that i've beat that or something  like well it's a worthy enemy to be fighting because it's a drug and it's one that should be  resisted for a creator.  I feel like it can do negative stuff to your mind  as a creator.  Oh yeah, for sure.  Anybody that controls you is not good.  A lot of people are controlled by their audience.  They don't have to have a puppet master  on a corporate level.  Audience incentive is a different type of,  I don't want to say slavery,  but yeah, it is.  And that's why variety is good.  And you're doing that yeah always expanding  uh well let me just zoom out on this you made a film yeah that's pretty cool yeah it was a great  experience man i mean it was awesome working with tim and eric awesome working with jonah hill  i feel the same about hbo and a24 everybody that i worked on the film with i have a lot of love for  and i appreciate the experience it It's my first movie.  It's a big deal. It's a good one.  In my head, I finally got to make the transition  from YouTuber  to filmmaker and that was always this  psychic barrier that I felt like I had  to jump over.  There's just the way it's shot, the humor  that goes throughout it,  just the narration  that you're doing in a shitty director's  That was really well done.  Whose idea was that?  It was actually Tim and Eric's idea.  There was a really great editor named Clay who works for Absolutely,  and they did all the editing pretty much in the office.  And so it was Clay's idea to add a retrospective director's chair narrative arc to the whole film.  Yeah, just like starting with the absurd fight and then going like,  oh, that's a good way to start a movie.  Just really, really well done.  Thanks, man.  What about Jonah Hill?  Great guy.  He believed in this.  He did.  So what's that like?  What do you think is behind him believing in such a wild project?  I think that Jonah Hill has a good eye for what's cool amongst the younger folks.  He's into skateboarding stuff.  That's why he did that film, Mid-90s. And I think he probably saw a similar thing in what was going on with All Gas, No Brakes and was like, shit, this could be big.  And so not only did he actually fund the film, he also gave me his agent.  And I forgot to mention that it was Jonah Hill's lawyers that he gave me for free that got me out of my contract eventually with Doing Things Media.  or freed me up to speak about what happened.  So he was also part of you kind of gaining your freedom.  Yeah, in a weird way.  Like, even though him and I don't talk that much,  just because he's doing his own thing,  Jonah Hill is like a huge factor in my current success  and just like everything that I've been able to accomplish.  Just on your own politics,  is it fair to say that your politics leans left?  I'm not really sure sometimes.  You know, I like to think that I am socially left.  I think people should be able to dress and act however they want.  I don't believe in restricting people's social freedoms.  Economics-wise, it doesn't seem like leftist economic policy works very well on a city funding level.  Like if you see what's going on in California,  it seems like the city leadership is mishandling the funds in California too.  So I don't know about that, but I don't know.  I don't really see myself as left or right.  I just never have.  Well, if you just like objectively zoom out  and don't have an insane standard of the extremes.  It feels like a lot of your work leans left.  I tend to lean toward the empathetic perspective, which I do think is more on the left than the right.  But also, I'm not into super PC stuff.  I don't believe in limiting free speech either.  I believe in a free internet, which I think is more embraced now by conservatives.  But it does seem that – maybe you can correct me, but I get the sense sometimes that the left attack their own very intensely.  It does happen, but every community has terms of exile.  I mean, look – imagine – think about what happens in the conservative realm.  You know, like when Black Rifle Coffee Company, like, denounced Kyle Rittenhouse.  They lost a lot of money, too.  Like, it's not, the right attacks its own, too.  I mean, think about Bud Light and stuff.  Like, they, I mean, you know, like, every community has terms of exile.  You just got to know who you're.  engaging with and you gotta make that decision carefully it'd be nice if there's an actual  write-up of the things you're not allowed to say for each thing and then yeah i wonder whose list  would be longer it just does feel like the last list is a little longer if you're a conservative  and you have a t-shirt with like a demon on it like say goodbye you know i mean there you know  there's certain stuff that they freak the hell out about. And conservatives are really concerned about pedophiles.  Yeah.  I mean, I don't like pedophiles either, but I don't think about it all the time.  One of the things you do in the film is kind of confront one of the QAnon folks where his concern is that everybody's a pedophile.  And you show it to him.  Well, he calls himself a pedophile hunter and makes videos exposing democratic elite  pedophile cabals and is himself a convicted child molester.  There's an old thing that people say that every confession, every accusation is a confession  to a certain extent.  So like it's bizarre that some people's whole life after a big mistake will revolve around  trying to seem like the good guy instead of taking accountability for themselves.  Yeah.  yeah it's a common thing you see all the time like neighborhood watch people you know what i mean like  what made you that you know like what did you do bro that you feel like you have to get karmic  retribution by doing the reverse i don't get it yeah do you think uh to the degree of bias that  affects your journalism no but i mean with the migrant situation i don't know what was that  covering that like i just got just got a lot of hate from  conservatives for like letting the migrants tell their stories about their journey and stuff.  Well, what did you learn from just going to the border? I mean, just the sheer desperation that  the citizens of the world are in. I mean, there's people who truly believe that America is the only  hope for their success and to feed their family.  And I think a lot of them are kind of getting catfished.  Meaning America has its problems too?  It has severe problems.  There's extreme poverty here.  But in America, like if you just compare it to other nations,  the level of corruption is much lower to where the opportunity –  For a person to succeed, to rise is higher.  I wish success on everybody who comes here.  But my thing is the expectation that they have and the sort of American dream propaganda they've been installed with isn't necessarily a reflection of contemporary American reality.  So I'm talking to people who speak no English and say, I'm here for a better life.  I go, where are you going to go?  They say, I have no idea.  And I'm like, man, that's tough.  And you almost think how bad are things elsewhere for someone to abandon their family,  make this journey across multiple continents and end up here with no plan.  And it just made me realize how sheltered I am to a certain extent as an American and going,  walking back what I said a little bit, because I was just trying to make a point, but what I think of as bad poverty, like let's say West Baltimore or  Ninth Ward, New Orleans, is nothing compared to what's going on in almost half of the world,  if not more. And so it just made me zoom out a little bit. Sometimes you forget about  third world poverty when you live here for some time.  And you get programmed to believe the worst things that are out there is like Kensington, Philadelphia or Tenderloin, San Francisco.  But those are just microcosms of more or less functioning cities.  Despite what they might lead you to believe, Philadelphia is a great place.  So is San Francisco.  But there's places where everywhere is really run down.  Yeah, like people focus on  in major cities in the United States,  like homelessness,  somehow that's a sign  of a fallen empire.  Right.  But, you know, that's a problem.  There's definitely,  it reveals some mismanagement of cities.  I mean, homelessness in Seattle  and San Francisco is for sure  a result of the housing crisis,  especially post-COVID and all the gentrification that preceded it.  And it's unfortunate now that the conservative media is saying, like, look at Biden's America as if Biden created homeless people.  And it's just disappointing because, once again, you're seeing the media use real issues that should concern every U.S. citizen and community.  causing people to point fingers at a different political party as responsible for the suffering of others.  Do you think January 6th can happen again?  No.  I don't think so.  So all the lessons were learned?  Yeah, for sure.  I mean, people got really screwed over.  Don't you have a sense that there's a greater and greater growing questioning of the electoral process and all this kind of  stuff. I think that Americans overall are very comfortable with our standard of living. I think  people like going to Sonic and waiting in their car and getting milkshakes and people like going  to the AMC theaters and they like going ice skating and mini golfing and going to the bar  after work. I don't think that anyone wants a collapse of the basic structure of the country. Even the most politically divided don't want to see 7-Eleven go away.  We are so comfortable.  If you look at other countries, even Europe, look at how they protest.  And look at the Arab Spring.  Those guys were talking like January Sixers, and they actually took control of the government.  And so –  Think about even if the MAGA crowd took over the Capitol building, it's just a building.  I don't know.  I just think that Americans, when they talk about Civil War stuff, it's just so – we're so far from that.  Even if the rhetoric is as divided as it was in 2020, it won't happen again.  For it to really happen, it has to be – there has to be a level of desperation. There has to be a level of economic desperation that's causing people to starve or some basic resource going away.  Water, something like that.  Who do you think wins, Trump or Biden?  In the Civil War?  Well, in the game of Mario Kart.  No, in the election 2024.  Oh, man, I have no idea, man.  I don't even know if I'm going to vote.  It's weird that this is our choice.  I know.  I wish people were more focused on, like, city politics.  Like, I'd rather vote, like, yes or no for a bike lane in my neighborhood than I would for the president.  So local politics to you is where it is.  I think the future... And you feel it, yeah. Oh, I mean, your vote actually matters. Let's say you have a community of 500 people  and you live in Henderson, Nevada.  You can influence  whether or not  there's a bike lane  or if this is going to be  a playground  or, you know,  an AMPM.  You get to choose  and you can influence  100 people to choose  and boom,  You can't influence the result of an election.  Still, those at the presidential level, it sets the tone of the country.  And so Trump running again and Biden running again, it just feels like there's going to be a lot of questioning of election results.  I just can't believe those are our guys.  Yeah.  I mean, what is that's really our guys?  Like, that's where we're at.  All these smart people we have in this country the great history we got joker gang versus gum gang where'd you find joker  gang well is he a legit juggler or is he just no no no no joker gang is like a miami cuban guy  oh is joker 305 rawest chico alive so me and i have been following him for a long time  on instagram because he used to like uh post videos of himself like popping percocets and  smoking blunts on the toilet freestyling and so i had followed him for a while and then i finally  got this platform and i said oh my god i bet you now that we have a million followers joker gang  will sit down with us  And lo and behold, the clout did its thing, and there I was face-to-face with the man.  There was a controversy a year ago where a woman came forward and said that you were pushy with her.  You respected and know you got the consent, but you were pushy about it.  Looking back, can you tell the story of that?  What are the lessons you learned from it?  Yeah, I mean, I've yet to speak on this for a lot of reasons, mostly because it's just it was a hard time and it's a sensitive subject.  And I've wanted to prioritize the reporting.  But I think that now I'm ready and able to do so.  Everything sort of started on December 30th, 2022.  And that was the release date of the HBO project.  Like I told you, we didn't know when the movie was going to come out.  We weren't told that it was going to come out on that date until early November. And so it was like, oh my God,  here we go. We had a movie coming out. HBO had, I didn't even know it was going to be them. So  every day for those 50 days to where I received word and to the movie announcement or to the  was like, I was like a kid waiting for Christmas morning. You know what I mean? It was like,  every day I just, I saw the movie release date as the first day of like the rest of my life.  And so I remember the week of the movie release, it was like every day I was like, oh my God,  six days, five days, four days. And when it became two days, like I was so excited. And so like,  honestly, anxiety riddled because it was such a  massive platform that I went out to the desert by myself out in the Mojave, got a hotel and just  kind of sat there. And then movie release day comes, it was supposed to come out at, um, 8 PM  Pacific standard time. I remember it was like 12 hours left, 10 hours left, and then eight minutes before the movie at 7.52, or I guess it was sent at 10.52 East Coast time,  I got a text message requesting a portion of my fat HBO check to contribute toward apparently years of therapy bills that this person had accrued after she says that she felt that I pressured her into giving consent.  years prior. And I was confused, not only because of the timing, but because this is someone that I  hadn't seen in years or spoken to in years. And I presume that I was on good terms with.  So I didn't respond to the text message. And then when I didn't respond, about seven days later,  this person made some TikTok videos and with the help of some friends,  launched an online campaign that got picked up by the press pretty quickly. So what did you feel like when you got that text? Well, it's tough because on one  hand, I'm not opposed to restitution being part of a private accountability process for real abuse.  You know, like if you've hurt someone to an extent that it took them out of work or something,  like I think they're entitled to some money. But unfortunately, as I later learned, this person had legal counsel. And this was an  attempt to basically create evidence by extracting a confession from me to use as precedent for a  civil lawsuit to the tune of a couple million dollars.  It's dark.  Yeah.  How did you meet this person?  Well, I met them when I was 22.  And like I told you, I was living in an RV making this show called All Gas, No Brakes.  And I would travel between cities like every other day.  And so I would basically pick a new city.  And I got in this like pretty bad habit of what I would say is essentially treating Instagram like a dating app.  You know, I would go to a new place. I'd post my location. I'd surf the DMS and I would look for  like fans to meet up with. It wasn't always girls. It was just people to party with. Cause I was also  partying every night, but a lot of times ended up being girls and stuff. And so that's kind of how this situation was. Um, I didn't have sex with this person. Had a consensual encounter  that they reached out to me about two weeks after saying, hey, I don't want you to take this the  wrong way. But looking back, I felt a lot more pressure to agree than I realized in the moment.  I don't think this is any fault of yours. I just think that you came on a bit too strong and I  I gave in.  And it was that language made me feel horrible,  mainly because if this person had told me, hey, I don't want to hook up,  I would have said, yeah, of course not.  I don't want to hook up with someone who doesn't want to hook up with me.  And I think that as fame increased during that time,  I think I was just kind of oblivious to how people were seeing me,  especially those who had a digital relationship with me  prior to me knowing them.  And I don't think that I handled that the right way.  Well, thank you for taking accountability.  But just to clarify,  you got consent.  Yeah, I was the initiatory party  in an interaction with a fan who felt it.  She had to say yes because of, I'm not sure why. I don't know why,  but like I said, this person also disclosed to me they had a history of childhood trauma  and were actively being treated for PTSD and that they felt things moved too fast for them  given their situation. And so I told her, I said, hey, if you want to reach out, if you want to talk  on the phone, I'm always here for you. I'm sorry to hear that. Let me know if we can talk further.  Um, about six months after that, um, I was at Sturgis bike week and, uh, I remember this day,  this was the hardest day. I was just chilling and I got a text from my friend and said, Hey man,  you're getting canceled right now. And I was like, what do you mean? Like, did someone find  an old tweet or something? What are you talking about? And I opened my phone and it was this  Instagram story of me. It was like the ugliest picture of me you can find. It was like my face open. It was like screenshotted. And it said, I remember this specifically because I just couldn't believe  it. It said, the ugly loser who hosts all gas, no brakes is a piece of shit. He knowingly abused  my friend and got away with it. If you follow him, I'm going to message you and ask you why.  So this person who I don't know, I didn't even know where, who the accusation was coming from.  They text, they emailed every production company that I was working with, DM hundreds, if not  thousands of people, like just saying that like, I was this piece of shit and I didn't even know  who this person was. So I was frantically calling and texting like every person that I'd seen  intimately for the past year and be like, Hey, are we on good terms? Is everything okay?  And then I figured out that the person was coming from Florida and I knew who it was.  And so thankfully I reached out to the original person who I had the communication with.  And I said, hey, like, I think this might have been you.  This might have been your friend who posted this.  Are we good?  Like, I'm sorry.  I apologized again.  I was like, listen, I feel bad that you feel this way.  I want to do anything that I can to help you.  Again, I apologize. And, um, she said,  apology accepted. I'm sorry. My friend asked if I could, if she could post on my behalf and I'm  sorry, I was going through a lot mentally and I saw your fame increasing. And so I agreed to let  her speak on my behalf. And, um, we let, we made amends in private. You know, I said, okay, I'm here for you. Let me know. And she said, apologies enough.  Thank you for taking the time to speak with me.  And that was two years prior to this text message being sent to my phone  eight minutes before the movie.  So naturally I wanted to go on my platforms and talk about what was  happening,  but I also didn't want to mess up the rollout of the movie.  You know, and so the PR firm was like, we got this.  We'll handle this for you.  And that was, I guess, by way of a TMZ thing that said Andrew Callahan is devastated.  I'm not sure why they thought that that was going to make people be in my favor.  But it was just a picture of me on NBC that said Andrew Callahan devastated by allegations that that was their plan, I guess, to show that I was remorseful or something.  How much of this do you think lawyers kind of pushing this when money and fame are involved?  Well, I wish I could say the lawyer, but I just can't.  That was involved in this.  But I will tell you that I try to lean away from resentment  and toward accountability completely  what was my role in the situation  how can I never make someone feel like that again  what can I do, what changes can I make  to make sure that  one, I never treat someone this way  and two, to never be in that position again  well  Again, thank you for taking accountability.  And the main reason I talk about that is because it wasn't just that person.  There was multiple people who made videos reporting similar behavior.  And so it's obvious that that was a pattern of behavior of mine.  And so I made the apology video to announce that I was taking some time away because I just needed time away.  I mean, my entire support system collapsed.  My friends at the time away. I mean, my entire support system collapsed. My friends at the time disappeared.  I was getting like obituaries texted to my phone that were like, Hey, it's been nice knowing you.  It was great to see you grow. Good luck. You know, like I was dead and, uh, yeah,  it got dropped from my agency. No one gave me tough love. No one called me to ask me if I was  all right. It was just only everyone disappeared in a week  again thank you for taking  accountability but I just  hate how many cowards there are out there  like  when people hit low points  is when  when you should  help  We should stand with them if you know their character.  Yeah.  And it was just hard to separate the initial situation that I knew was more or less a setup and the possibly genuine other accounts.  And so it was like, all right, you know what?  At this point in my life, I want to be on the right side of history.  I don't want to be the anti-cancel culture mouthpiece.  I don't have the mental strength to fight this, especially because I was envisioning the HBO drop to be this, like, the world opens up to me moment, and it was just the reverse.  But it wasn't so much the media reporting on it that hurt me.  It was just little stuff, like a childhood friend that you love seeing.  They unfollowed you on Instagram or just like seeing someone on the street that  you grew up with and like waving at them and they don't,  they don't do anything back.  And you're just like,  Oh my God,  man,  like this is my new life.  But what are you supposed to do? Thankfully, I like somehow two weeks after I met an amazing partner who I'm still with to this day. And I was able to conquer my two biggest fears, which is monogamy and dogs. I was terrified of dogs and terrified of having a girlfriend. Now I have a girlfriend who I love and two dogs.  So what were the, what was the lowest point well right after this happened i entered like a  recovery programs started with aa but then i found a more specialized program that dealt  with the issues that i was dealing with say the hardest point was um was, um, logically deducing that the lives of my loved ones would be better off if I  was gone. You know what I mean? And, uh, thinking that my, my, my mom and my friends, that their  life would be better if I took myself out of the picture. And, um, for one,  I just figured, you know, their friend's canceled.  You know, her son is a disgrace.  My family's going to think they raised me wrong.  I'm a social pariah now.  I'm a burden.  I'm better off dead.  And the hard part was, you know, I would read stories and books written by parents who lost their kids to suicide.  And they reported feeling a lot of anger after the suicide.  So I tried to think of what's the way I can do it to get the least amount of anger on behalf of the people who would grieve.  Because hanging someone will discover you.  So I figured that drinking myself to death would be the way to do it.  And I wasn't able to.  Yeah, that was just a dark place. I remember hating the people who loved me because I knew they would grieve, and that made me mad.  That makes sense.  Like I was ready to go.  I had no will to live.  But their grief was like I didn't want to cause that because I didn't want to hurt them.  And so I was like, I hated the people who loved me because they were stopping me from taking my own life.  And it's weird to think that when I was going through that, if you walk by me in the street, I look like a normal guy.  And so now when I walk around and I see people, I think to myself, you have no idea what that person is going through.  I think to myself, you have no idea what that person is going through, you know?  Like, it's crazy that so many people are suffering in, like, complete silence, and you can't, they don't wear it on them, you know?  Many of the people you talk to are probably that.  Yeah.  Many people you've interviewed before all this and after are probably going through some shit.  I also thought if I could write down what I just told you on a piece of paper  and I was to do it  and then they found the note  they would take it more seriously  because they would know that I wasn't lying.  Yeah.  But then, you know...  If you do it, it reduces the lifespan of your parents by 15 years.  So I looked at it like I was taking time away from them.  Well, thank you for the most part, leaning towards accountability.  It's the right path to take.  What advice would you give to young men that look up to you on how they can be good men, especially in regard to women.  If you have any kind of platform, you know, whether it doesn't have to be famous on Instagram,  it could be like if you're a pillar of your community in the culinary world or whatever it is.  Just be hyper aware of that and remember that you are inheriting a power dynamic  that can create situations where there might be some pressure that you don't even realize is there,  but it's definitely there, and you just have to be aware of that.  And two, when meeting new partners, having hookups and stuff like that,  just try to have a trauma-informed conversation about their past.  really know the experiences and the backstory of what a new partner has gone through in that world  of intimacy, whatever they're comfortable, uh, you know, to share, obviously, but, you know,  I would advise against one night stands. I would advise against hooking up with someone, um,  that you're meeting for the first time, have those conversations prior, because even though  it might sound like a vibe killer, it's not. And if you think that that conversation is a vibe killer,  you probably shouldn't be in that situation in the first place. Especially now, how hyper  sexualized things are and how common that type of violence is. You need to be able to have those  conversations and stop and say, hey, tell me a little bit about your past. Is there any triggers that make you uncomfortable? Let me know how I can be the best partner to you.  And I'm sure that college-age people are not having those conversations,  but I'm sure that it would go a long way.  So especially when you're young, college-aged,  you don't have enough experience to be able to read a person  without having that conversation.  Because a lot of times you can see the trauma without explicitly talking about it. But that takes experience and knowledge and seeing the world.  When you're young and you really don't know shit, making things a bit more explicit is probably better.  Yeah, and also, as men, we're trained to believe that it's our duty to be the initiatory party in any type of sexual encounter.  like, oh, like man chases woman. You know what I mean? Like, you know, you have to be the one to  make the move and, or like, she's playing hard to get if, you know, she's resistant to your first  like compliment or something. I think that that's not always how it has to be. And that extra  caution needs to be placed. If you're taking the initiatory role in an interaction, especially if  someone has a traumatic background, they might agree to do something with you because they're scared and you might not realize that's what's going on. But because you don't see yourself as a predatory  person, you don't see yourself as someone who would ever consciously make someone uncomfortable  or cross a boundary, but people have histories that you might not understand. And for me,  as someone who doesn't have much, honestly, like childhood trauma or anything like that,  it's been an interesting year for me working in therapy and elsewhere,  understanding how that affects the mind.  And also I understand that hurt people hurt people and that someone with a  traumatic background isn't going to have sympathy for applying that traumatic  pain to someone else,  even if that person isn't the cause of what put them in that spot.  If we can go back to Channel 5, can you tell the origin story of that?  Yeah.  I mean, Channel 5, during the All Gas No Brakes days, we used to tell people that we were called Channel 5 if we wanted them to stop antagonizing us while we were filming.  Because every town has a Channel 5.  So when people were like, what's this for?  If they were being super rude and trying to get in the camera and be hella obnoxious, we would just say, oh, we're Channel 5.  And they would be like, oh, my grandma's going to see that. And they would leave us alone. So Channel 5 was a diversion tactic during all gas, no brakes. And it just so happened that we were in Miami Beach one time.  And this kid came up like drinking liquor, like, you know, trying to yell about like whatever,  whatever they yell about in Miami Beach, like titties or whatever. And we're like, bro, this is Channel 5. Be careful what you say. And he was like, for real?  And he just walked off.  And I said to my friend at the time, I was like, that sounded pretty good, right?  Channel 5.  And he goes, that does sound pretty good.  He's like, that's got to be trademarked, though.  No.  It's not trademarked.  It's crazy, right?  There's a Channel 5 in every city.  We own it.  Because no one's thought of something that simple.  Because you'd think you'd have to specify.  We own channel5.com, channel5.news.  Dude, we own it.  It's awesome.  So it was the same kind of spirit as the previous thing.  Yeah.  What was the first one you did under the Channel 5 flag?  Miami Beach Spring Break.  I think I've seen that.  It's going to be a callback.  I think somebody mentioning eating ass there, too.  That would be the place.  I believe that was.  There's only about five places in the U.S. where people yell about eating ass all the time.  Bourbon Street, South Beach, Miami, 6th Street in Austin, Broadway in Nashville,  and I'm just going to go ahead and say Times Square.  You might not think it, but –  Times Square, really?  Yeah, they yell about ass there.  Times Square.  I would say Beale Street in Memphis, but it's not good.  Oh, yeah.  I mean, Beale Street is like – the median age is too high on Beale Street for anyone to yell about ass.  Oh, this is a fascinating portrait of America through that specific lens.  So Miami Beach.  And then how would you describe your style of interviewing?  Just now that you've collected so many, if you had a style, how would you describe your style?  I guess before, especially it used to be like deadpan.  Now I would describe it as more directed, but still relatively  affable, agreeable, deadpan interview style. Yeah. There's a, like in the face of absurdity,  yeah. It was just like there with a microphone that there's a, there's a comic aspect to it.  And that's intentional. Yeah. I used to look at the camera, like Jim from the office back in the  day. Yeah. I don't do that anymore.  What about the editing?  Like, how do you think about the editing?  I still do most of it.  But Susan helps a lot, too.  It's my associate.  Yeah, the editing style.  Like I said, we pioneered this editing style that honestly was inspired a bit by, like,  Vic Berger.  But we took  kind of chopping up vocals a bit to add comedic timing where it didn't necessarily exist.  Like you might add two seconds of awkward silence that are built with room tone,  or you might make everything really fast by cutting silence and switching frames.  I mean, switching camera angles.  But now we try to be pretty straightforward because we want to be taken more seriously.  You know?  Yeah, sure.  What's crash zoom, by the way?  A crash zoom is when the, like, it's artificial zoom that you might add in Adobe Premiere where the camera zooms in on someone's face.  Where the resolution is not there.  The resolution is not there unless you have a Blackmagic cinema camera.  Which you don't.  We don't use those.  The file size is too big.  That's the only constraint?  Yeah.  100%.  And you also do voiceover storytelling.  I think the first time I really did that was in the San Francisco Streets video  because there's so much content about San Francisco, homelessness, tenderloin, shoplifting,  but there's not that much context in those videos about the history of San Francisco,  the housing crisis, nimbyism, random zoning stuff that sounds boring  but has a major role in the current situation.  the streets there as to why the tenderloin is neglected by police and by the city council  and the other neighborhoods like knob hill and north beach are so nice so i added that purposely  to the san francisco video and then also to the philadelphia streets video to accentuate the  reporting and add some historical analysis what's your goal with some of these videos like the  philadelphia streets one is it to reveal the full spectrum of humanity or is it also to tell a  story that's almost political well nothing number one is always humanization that's the primary goal  is to take people in circumstances where they're often news items and remind the public that these  are people with lives and concerns and dreams just like you but secondly we also want to start  introducing more solution-oriented journalism so not just just, oh, my God, I'm becoming aware of how horrible this is, but what can you actually do to help?  And as you can see with the Vegas Tunnels video, people are responding pretty positively to it.  Like here's how you can maybe help a homeless neighbor, help get them an ID, help them qualify for housing or get a job at the scrapyard.  There's always ways to help.  But so much of the YouTube world is oversaturated by just like endless videos of people suffering.  And the comments are always like, wow, so horrible.  But what does that really do for somebody, you know?  uh you've uh interviewed many rappers yes as you keep me there's a lot to it yeah uh can you  explain this drill rap situation what's what is drill right evolving situation drill began in 2010  some people say it was chief keith in chicago i think it was king louis in chicago but i think  all of it was very influenced by waka flakaa Flame, who dropped an album called Flocka Valley in 2010 that was like hyper-violent, adrenaline-boosting  rap music made by people who were actually in the streets.  So in the 90s, like if you had 50 Cent, you had rappers rapping about like whatever gangster  shit, selling crack and beating people up, but they weren't actually doing it.  Drill has a true crime component to where drill fans want to know that the person rapping about catching bodies does in fact kill people.  So drill is, uh, it's pretty horrifying.  It sounds great, but it started in Chicago, then it spread to England and now it's bounced  back to New York.  The Bronx and Brooklyn specifically and spread from New York to the rest of the country.  So now there's probably a drill wrapper every 10 square miles.  So these are, as opposed to pretending to be a gangster and killing people, you get some credibility by actually doing it.  Yes.  And the fans are typically not in the communities that are affected by poverty.  So they're kind of like superheroes to white kids.  It's dark.  And not just white kids, but just anyone who's not in the hood.  It's not necessarily a race thing.  There's white drill rappers, too.  Slim Jesus was a big one.  He's out of the picture now.  But there's white drill rappers.  Slim Jesus.  You made a video on Oblock.  Yeah.  What is Oblock?  The place, the culture, the people.  Oblock is a housing project in South Chicago in the Englewood area where Michelle Obama grew up.  It's also where Chief Keef was born and raised.  I don't know if he was born there, but he was raised there.  And he is the forefather of modern drill music as we know it.  So these are the projects where drill began.  It's also the first place where you have that intersection of drill music and true crime because Oblock has a lot of rappers, and then nearby is an area called St. Lawrence, a.k.a. Tukaville, which has a lot of rappers as well.  And so these two rival drill gangs basically have a lot of history, and it connects to music at large.  So you've interviewed people there  was there any concern for your safety no i mean i think that uh oblock is has calmed down a lot  for one it has security so you can't even really get in and out but two i think that oblock's trying  to rebrand itself a lot because it could be because Lil Durk's avoiding a Rico charge.  Could be for a variety of reasons.  I know you don't know exactly what that means, but...  Lil Durk or Rico charge?  Rapper Lil Durk is affiliated with Oblock.  Yep.  And a lot of people have been murdered in retribution for...  killings that Lil Durk may or may not have influenced the ordering of.  But anyways.  And Lil Durk documented the killings via rap music probably.  Okay.  I know you don't know about Drill,  but Lil Durk was associated with a rapper named King Von,  and King Von perhaps paid for the assassination of a rapper named FBG Duck  who got killed in Chicago's Gold Coast neighborhood.  It's possible.  The Oblock Six are Drill-associated, not rappers, but just shooters,  and they perhaps operated on King Von's behalf when he killed FBG Duck.  King Von was Lil Durk's artist.  King Von's now dead.  So there's definitely a concern that some of the Fed charges will fall on Durk.  Not sure if that's true, but it's rumors in the hip hop community.  So Oblock right now, and when I filmed the video, is trying to go through a major image  rehab.  If you go on any Instagram of anyone in Oblock, they've all converted to Islam.  And so they post pictures of themselves praying in the morning and have captions like, put  the guns down.  let's pray.  So I think when I went there,  they saw it as a good opportunity to do a positive rebrand.  And so I interviewed a rapper named boss top who was there all the way back in  2011 when chief Keith was coming up.  And so he basically ensured my safe protection,  but he didn't even need to.  They're all very friendly and they know exactly what's up with YouTube stuff.  I like how 2011 is the old days,  like the ancient.  Oh yeah.  The founding fathers.  I was in eighth grade.  Oh, man.  Time flies when you're having fun.  It sure does.  Lil Durk.  Where's Lil Durk now?  Atlanta.  So he left Chicago.  Not safe.  Yeah.  I mean, every rapper has to leave their hometown.  It's what I did.  It's a journey.  Seattle would have taken me out, bro.  I mean, you do interview a lot of people.  I mean, that's like a top comment, but it speaks to the reality of the fact that you always find somebody rapping.  Or you create the space for people to rap.  What's that about?  I don't know, man.  They're usually really good.  I appreciate it.  Well, hell yeah, man.  I mean, rappers.  In their own way.  Since I touched the microphone, rappers have gravitated toward me.  I think there's something happening.  You're a rapper whisperer.  I think there's something happening on a deeper cosmic spiritual level.  Yeah.  That lets the mind of rappers know that, like, they have a safe place in front of our camera crew.  You have an interview with Kirk Mack?  I do.  Who is Krip Mac? He's a deal right now.  Oh, he is?  Yeah.  Is that a hashtag?  Yeah, for sure.  That's an intense interview.  People should go watch it.  People should go watch all your interviews, but that one is pretty intense.  Thanks.  I was a little afraid for your life.  Oh, Krip Mac's the safest guy in the world.  He's a sweetheart? Oh, definitely, dude.  I feel more safe around Krip Mac than I do with any given pedestrian.  Yeah, he was loud and flavorful, I should say.  So who's he?  What's his story?  Well, his name's Trevor.  He grew up in Ontario, California in the Inland Empire, moved to Texas with his mom after his dad left.  His mom started dating a cop from Houston named Mr. Gary.  His mom found Mr. Gary getting...  you know,  anally penetrated by a coworker.  And so,  uh,  she booked Crip Mac,  uh,  one way Greyhound ticket to LA where he joined the Crips.  That's a good story.  You know,  it's true.  Oh,  you jumped right to Mr.  Gary.  Yeah.  Yeah,  of course.  I'm just saying that,  uh,  you know, he's a classic case of somebody without a father figure who found camaraderie and, you know, sense of belonging and purpose in a street gang, which in L.A. is like a rule of law in most of the city.  I forget what context.  Earlier talking about martial arts and fighting, and he's got to work on his punching form.  Yeah, I think so.  He gets into a lot of fights in jail, though,  and from what I've heard, he wins, like, about half of them.  All right, what did he go to jail for now?  Firearm possession.  It was a probation violation.  Oh.  It's too bad.  All right.  So Philly, you went to the border. Mm-hmm.  You occupied Seattle protests.  You went to Ukraine.  Yeah.  What are some interesting things that stand out to you from memory, just as I ask the question?  Some interesting...  I mean, I was in jail at the border for a while.  That was horrible.  What was that like?  Was that your first time?  Yeah, well, you know, I didn't know that I couldn't hop my own border as an American.  I'm thinking, this is my country.  I can get in any way that I want.  Wrong.  You can only enter the U.S. through an official port of entry, which I learned the hard way because I got arrested by Border Patrol  and held as a detainee at a migrant center for a few days.  What was that like?  Horrible.  Which aspect?  I mean, well, for one, like, I don't know.  It was just to be in a place like that.  And I probably sound like such a wimp right now because I know someone's watching this who's done some hard time.  But we thought we were going to do at least six months in jail because the guards freaked us out.  And we're like, you're being charged with a federal crime.  You know what you boys did is serious.  We're waiting on word from San Antonio about whether  So we're just sitting in these cells alone, most of the time in solitary, with no pillows.  No pillows.  No pillows, no mat, nothing.  Just a space blanket, and I was sleeping on my shoes, stinking up the place.  It was no good.  You mentioned the UFO convention.  Yeah.  What have you learned from those guys, the UFOlogists?  I really want to know what you think about that.  That's the one question that I want to reverse on you.  Because you've talked to so many people.  Do you think that aliens have actually visited Earth?  Yeah.  When?  Exact dates?  I do.  I think there's alien civilizations everywhere.  I talk to a lot of people that have doubts about it.  Civilization is everywhere.  I talk to a lot of people that have doubts about it.  I just think, I even suspect there's an intelligent alien civilization in our galaxy.  And I just can't imagine them not having visited us.  So I lean on that. What that actually looks like, I don't know.  the stuff we're seeing in terms of UFO sightings,  I think that's much more likely,  to the degree it's real,  it's much more likely government projects.  So military, Lockheed Martin, this kind of stuff.  So you think that they have knowledge of it?  Yeah.  One thing I think about with aliens is scale.  So we have this idea that an alien would be a gray alien  or almost humanoid lookalike that would visit us in  human form. Arms, legs, head. But who's to say that they're not able to shrink  down to microscopic size with the same neural capacity?  Or just have a very difficult to perceive form. But I mean,  they would go small, not big. No, I think that would take a humanoid-like  form just to be able to communicate with humans.  I think the big challenge with aliens is to be able to find a common language.  So if you come to another planet and you suspect that there's some kind of complexity going on,  but it looks nothing like humans, you have to find a common language.  And I think aliens would try to take physical form that's similar that us dumb humans would understand.  Language is really interesting, too.  I have this series that I'm going to announce for the first time on here.  But I'm really interested in endangered languages in the U.S.  There's like 150 languages in the U.S. with less than 1,000 speakers.  Wow.  And I want to, like, help spearhead efforts to preserve some of these.  Like, for example, Hawaiian sign language.  15 of those people left.  Holy shit.  Because when Hawaii got annexed,  the ASL community tried to make it so the deaf native Hawaiians wouldn't be  able to speak their native sign language.  And so they would do it under the desks at like schools for the deaf and  blind.  And they would get like their mouth washed out,  washed out with soap and stuff.  If they so much as did the Hawaiian hand signs.  Also the Gullah Geechee language in the South Carolina Sea Islands, Hilton Head Island and  stuff, that's like a, it's almost a Creole language that's been in the U.S. for hundreds  of years, existing in isolation.  That's being threatened by golf course developments.  I don't know how into language you are, but I've been getting super nerded out about it.  Actually, I'm interviewing somebody tomorrow who is an expert in human language. He's from MIT, studying the syntax of a lot of languages, including in the Amazon jungle, the peoples that live in the Amazon jungle region.  Yeah, it's fascinating.  Human language is fascinating, and also the barriers it creates.  and also how the games are played to what you're speaking by governments.  This is part of the story of Russia and Ukraine is a battle over language.  The Ukrainian language is a symbol of independence,  which is why they were trying to make it the primary language of the nation.  So sometimes the language represents the culture and the peoples.  Yeah.  And it's intricately tied to the culture of the people.  I've been trying to learn Navajo.  Which languages do you know?  Spanish and English.  Spanish well?  Si.  I don't know Spanish that well, so that passes me.  You're fluent.  Oh, it doesn't. You're fluent, basically.  Oh, it doesn't.  Hola.  That was good.  That was real Cancun spring break.  Well, I actually speak fluent Spanish, according to Spotify,  because every episode is translated, overdubbed by AI in Spanish.  Oh, my God.  You have a Spanish robot assigned to you?  I have a Spanish robot.  I sound incredibly intelligent and intellectual in Spanish. Yeah, there's a very... You have a Spanish robot assigned to you? I have a Spanish robot. It's really... I sound, like, incredibly intelligent and intellectual in Spanish.  You're not a freedman.  Exactly.  From everything you've done, all the people you've seen, do you think most people are good underneath it all?  Yeah.  So the ones that do all the extreme shit?  Okay, I'll put it like this.  Most people think they're doing the best thing for the world.  I don't think anyone except for maybe a small fraction of sociopaths wakes up every day and says,  I'm going to fuck somebody's life up today. I think the far majority of people are fighting for what they think is right and do  want to see America succeed and want us to be in a happy place where no one is subjugated.  I just think people have drastically different ideas of what means will get us there. And  unfortunately, that's leading to a lot of misunderstandings between cultures. And yeah,  I think that most people are good.  I've been through some things that leads me to believe that a lot of people, though, are primarily motivated by self-interest.  And that in a fight or flight situation, most people will choose flight.  So I don't know if people are courageous as a whole, but I think generally good.  But the energy to stand up for what's right, I'm not sure about that.  They have the capacity, though, to do good.  I think human beings are inherently selfish as well.  But I don't think that selfish is inherently bad.  I think humans are primarily motivated by self-interest, but generally have positive intentions.  I do hope more humans rise to the occasion and have courage.  Courage of their convictions. Courage  to have integrity.  But yeah, I think that most  people are good. And they want to do good.  And they have the capacity to do a lot of good.  That's why I have hope for this  whole thing we've got going on.  How do you heal the misunderstandings between people,  you think? Listening.  It's the only option we have.  No forced education.  No, like, forced meetings or mediations between political opponents.  Just listen to more people.  And really listen.  Try to get rid of whatever preconceived notions you might have about how you should feel about someone you are supposed to disagree with.  And just keep your ears and your heart open to people that you don't know.  And your life will change.  keep your heart open.  A lot of people are scared to listen.  Well,  Andrew,  I'm a big fan and thank you for being one of the best listeners in the world.  Amen.  And showing the full spectrum of humanity to us so we can listen as well and learn.  And just thank you for doing everything you're doing.  Amen.  Thanks so much for having me on.  You're a great man.  Thank you,  brother.  I appreciate it.  Thanks for listening to this conversation with Andrew Kalkin.  To support this podcast, please check out our sponsors in the description.  And now, let me leave you with some words from Hunter S. Thompson.  The edge.  There is no honest way to explain it, because the only people who really know where it is are the ones who have gone over.  Thank you for listening and hope to see you next time."
}
